bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef  __NPU_REG_H__
#define  __NPU_REG_H__

#include "bl808.h"

/* 0x00 : BALI_GENERAL_CFG */
#define NPU_BALI_GENERAL_CFG_OFFSET                             (0x00)
#define NPU_REG_IMGI_UNSGN                                      NPU_REG_IMGI_UNSGN
#define NPU_REG_IMGI_UNSGN_POS                                  (0U)
#define NPU_REG_IMGI_UNSGN_LEN                                  (1U)
#define NPU_REG_IMGI_UNSGN_MSK                                  (((1U<<NPU_REG_IMGI_UNSGN_LEN)-1)<<NPU_REG_IMGI_UNSGN_POS)
#define NPU_REG_IMGI_UNSGN_UMSK                                 (~(((1U<<NPU_REG_IMGI_UNSGN_LEN)-1)<<NPU_REG_IMGI_UNSGN_POS))
#define NPU_REG_IMG_IN_MODE                                     NPU_REG_IMG_IN_MODE
#define NPU_REG_IMG_IN_MODE_POS                                 (8U)
#define NPU_REG_IMG_IN_MODE_LEN                                 (2U)
#define NPU_REG_IMG_IN_MODE_MSK                                 (((1U<<NPU_REG_IMG_IN_MODE_LEN)-1)<<NPU_REG_IMG_IN_MODE_POS)
#define NPU_REG_IMG_IN_MODE_UMSK                                (~(((1U<<NPU_REG_IMG_IN_MODE_LEN)-1)<<NPU_REG_IMG_IN_MODE_POS))
#define NPU_REG_FTABLE_IDX_BASE                                 NPU_REG_FTABLE_IDX_BASE
#define NPU_REG_FTABLE_IDX_BASE_POS                             (16U)
#define NPU_REG_FTABLE_IDX_BASE_LEN                             (6U)
#define NPU_REG_FTABLE_IDX_BASE_MSK                             (((1U<<NPU_REG_FTABLE_IDX_BASE_LEN)-1)<<NPU_REG_FTABLE_IDX_BASE_POS)
#define NPU_REG_FTABLE_IDX_BASE_UMSK                            (~(((1U<<NPU_REG_FTABLE_IDX_BASE_LEN)-1)<<NPU_REG_FTABLE_IDX_BASE_POS))
#define NPU_REG_FTABLE_DAT_BASE                                 NPU_REG_FTABLE_DAT_BASE
#define NPU_REG_FTABLE_DAT_BASE_POS                             (24U)
#define NPU_REG_FTABLE_DAT_BASE_LEN                             (6U)
#define NPU_REG_FTABLE_DAT_BASE_MSK                             (((1U<<NPU_REG_FTABLE_DAT_BASE_LEN)-1)<<NPU_REG_FTABLE_DAT_BASE_POS)
#define NPU_REG_FTABLE_DAT_BASE_UMSK                            (~(((1U<<NPU_REG_FTABLE_DAT_BASE_LEN)-1)<<NPU_REG_FTABLE_DAT_BASE_POS))
#define NPU_AXI_W_IDLE                                          NPU_AXI_W_IDLE
#define NPU_AXI_W_IDLE_POS                                      (30U)
#define NPU_AXI_W_IDLE_LEN                                      (1U)
#define NPU_AXI_W_IDLE_MSK                                      (((1U<<NPU_AXI_W_IDLE_LEN)-1)<<NPU_AXI_W_IDLE_POS)
#define NPU_AXI_W_IDLE_UMSK                                     (~(((1U<<NPU_AXI_W_IDLE_LEN)-1)<<NPU_AXI_W_IDLE_POS))
#define NPU_AXI_R_IDLE                                          NPU_AXI_R_IDLE
#define NPU_AXI_R_IDLE_POS                                      (31U)
#define NPU_AXI_R_IDLE_LEN                                      (1U)
#define NPU_AXI_R_IDLE_MSK                                      (((1U<<NPU_AXI_R_IDLE_LEN)-1)<<NPU_AXI_R_IDLE_POS)
#define NPU_AXI_R_IDLE_UMSK                                     (~(((1U<<NPU_AXI_R_IDLE_LEN)-1)<<NPU_AXI_R_IDLE_POS))

/* 0x04 : BLAI_INT_CFG */
#define NPU_BLAI_INT_CFG_OFFSET                                 (0x04)
#define NPU_REG_BLAI_START                                      NPU_REG_BLAI_START
#define NPU_REG_BLAI_START_POS                                  (0U)
#define NPU_REG_BLAI_START_LEN                                  (1U)
#define NPU_REG_BLAI_START_MSK                                  (((1U<<NPU_REG_BLAI_START_LEN)-1)<<NPU_REG_BLAI_START_POS)
#define NPU_REG_BLAI_START_UMSK                                 (~(((1U<<NPU_REG_BLAI_START_LEN)-1)<<NPU_REG_BLAI_START_POS))
#define NPU_REG_BLAI_STOP                                       NPU_REG_BLAI_STOP
#define NPU_REG_BLAI_STOP_POS                                   (1U)
#define NPU_REG_BLAI_STOP_LEN                                   (1U)
#define NPU_REG_BLAI_STOP_MSK                                   (((1U<<NPU_REG_BLAI_STOP_LEN)-1)<<NPU_REG_BLAI_STOP_POS)
#define NPU_REG_BLAI_STOP_UMSK                                  (~(((1U<<NPU_REG_BLAI_STOP_LEN)-1)<<NPU_REG_BLAI_STOP_POS))
#define NPU_REG_BLAI_RESUME                                     NPU_REG_BLAI_RESUME
#define NPU_REG_BLAI_RESUME_POS                                 (2U)
#define NPU_REG_BLAI_RESUME_LEN                                 (1U)
#define NPU_REG_BLAI_RESUME_MSK                                 (((1U<<NPU_REG_BLAI_RESUME_LEN)-1)<<NPU_REG_BLAI_RESUME_POS)
#define NPU_REG_BLAI_RESUME_UMSK                                (~(((1U<<NPU_REG_BLAI_RESUME_LEN)-1)<<NPU_REG_BLAI_RESUME_POS))
#define NPU_REG_INT_CLR                                         NPU_REG_INT_CLR
#define NPU_REG_INT_CLR_POS                                     (8U)
#define NPU_REG_INT_CLR_LEN                                     (1U)
#define NPU_REG_INT_CLR_MSK                                     (((1U<<NPU_REG_INT_CLR_LEN)-1)<<NPU_REG_INT_CLR_POS)
#define NPU_REG_INT_CLR_UMSK                                    (~(((1U<<NPU_REG_INT_CLR_LEN)-1)<<NPU_REG_INT_CLR_POS))
#define NPU_STS_BLAI_INT                                        NPU_STS_BLAI_INT
#define NPU_STS_BLAI_INT_POS                                    (9U)
#define NPU_STS_BLAI_INT_LEN                                    (1U)
#define NPU_STS_BLAI_INT_MSK                                    (((1U<<NPU_STS_BLAI_INT_LEN)-1)<<NPU_STS_BLAI_INT_POS)
#define NPU_STS_BLAI_INT_UMSK                                   (~(((1U<<NPU_STS_BLAI_INT_LEN)-1)<<NPU_STS_BLAI_INT_POS))
#define NPU_REG_RELU_N                                          NPU_REG_RELU_N 
#define NPU_REG_RELU_N_POS                                      (16U)
#define NPU_REG_RELU_N_LEN                                      (5U)
#define NPU_REG_RELU_N_MSK                                      (((1U<<NPU_REG_RELU_N_LEN)-1)<<NPU_REG_RELU_N_POS)
#define NPU_REG_RELU_N_UMSK                                     (~(((1U<<NPU_REG_RELU_N_LEN)-1)<<NPU_REG_RELU_N_POS))

/* 0x10 : BLAI_WEIGHT_ADDR */
#define NPU_BLAI_WEIGHT_ADDR_OFFSET                             (0x10)
#define NPU_REG_WEIG_ADDR_BASE                                  NPU_REG_WEIG_ADDR_BASE
#define NPU_REG_WEIG_ADDR_BASE_POS                              (0U)
#define NPU_REG_WEIG_ADDR_BASE_LEN                              (32U)
#define NPU_REG_WEIG_ADDR_BASE_MSK                              (((1U<<NPU_REG_WEIG_ADDR_BASE_LEN)-1)<<NPU_REG_WEIG_ADDR_BASE_POS)
#define NPU_REG_WEIG_ADDR_BASE_UMSK                             (~(((1U<<NPU_REG_WEIG_ADDR_BASE_LEN)-1)<<NPU_REG_WEIG_ADDR_BASE_POS))

/* 0x14 : BLAI_BIAS_ADDR */
#define NPU_BLAI_BIAS_ADDR_OFFSET                               (0x14)
#define NPU_REG_BIAS_ADDR_BASE                                  NPU_REG_BIAS_ADDR_BASE
#define NPU_REG_BIAS_ADDR_BASE_POS                              (0U)
#define NPU_REG_BIAS_ADDR_BASE_LEN                              (32U)
#define NPU_REG_BIAS_ADDR_BASE_MSK                              (((1U<<NPU_REG_BIAS_ADDR_BASE_LEN)-1)<<NPU_REG_BIAS_ADDR_BASE_POS)
#define NPU_REG_BIAS_ADDR_BASE_UMSK                             (~(((1U<<NPU_REG_BIAS_ADDR_BASE_LEN)-1)<<NPU_REG_BIAS_ADDR_BASE_POS))

/* 0x18 : BLAI_INST_ADDR */
#define NPU_BLAI_INST_ADDR_OFFSET                               (0x18)
#define NPU_REG_INST_ADDR_BASE                                  NPU_REG_INST_ADDR_BASE
#define NPU_REG_INST_ADDR_BASE_POS                              (0U)
#define NPU_REG_INST_ADDR_BASE_LEN                              (32U)
#define NPU_REG_INST_ADDR_BASE_MSK                              (((1U<<NPU_REG_INST_ADDR_BASE_LEN)-1)<<NPU_REG_INST_ADDR_BASE_POS)
#define NPU_REG_INST_ADDR_BASE_UMSK                             (~(((1U<<NPU_REG_INST_ADDR_BASE_LEN)-1)<<NPU_REG_INST_ADDR_BASE_POS))

