bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x1C : APU_DM0_ADDR */
#define NPU_APU_DM0_ADDR_OFFSET                                 (0x1C)
#define NPU_REG_IMG_ADDR_BASE                                   NPU_REG_IMG_ADDR_BASE
#define NPU_REG_IMG_ADDR_BASE_POS                               (0U)
#define NPU_REG_IMG_ADDR_BASE_LEN                               (32U)
#define NPU_REG_IMG_ADDR_BASE_MSK                               (((1U<<NPU_REG_IMG_ADDR_BASE_LEN)-1)<<NPU_REG_IMG_ADDR_BASE_POS)
#define NPU_REG_IMG_ADDR_BASE_UMSK                              (~(((1U<<NPU_REG_IMG_ADDR_BASE_LEN)-1)<<NPU_REG_IMG_ADDR_BASE_POS))

/* 0x20 : APU_DM1_ADDR */
#define NPU_APU_DM1_ADDR_OFFSET                                 (0x20)
#define NPU_REG_IMG_MEM_SEG                                     NPU_REG_IMG_MEM_SEG
#define NPU_REG_IMG_MEM_SEG_POS                                 (0U)
#define NPU_REG_IMG_MEM_SEG_LEN                                 (32U)
#define NPU_REG_IMG_MEM_SEG_MSK                                 (((1U<<NPU_REG_IMG_MEM_SEG_LEN)-1)<<NPU_REG_IMG_MEM_SEG_POS)
#define NPU_REG_IMG_MEM_SEG_UMSK                                (~(((1U<<NPU_REG_IMG_MEM_SEG_LEN)-1)<<NPU_REG_IMG_MEM_SEG_POS))

/* 0x24 : BLAI_TF_CFG0 */
#define NPU_BLAI_TF_CFG0_OFFSET                                 (0x24)
#define NPU_REG_TENFLOW_EN                                      NPU_REG_TENFLOW_EN
#define NPU_REG_TENFLOW_EN_POS                                  (31U)
#define NPU_REG_TENFLOW_EN_LEN                                  (1U)
#define NPU_REG_TENFLOW_EN_MSK                                  (((1U<<NPU_REG_TENFLOW_EN_LEN)-1)<<NPU_REG_TENFLOW_EN_POS)
#define NPU_REG_TENFLOW_EN_UMSK                                 (~(((1U<<NPU_REG_TENFLOW_EN_LEN)-1)<<NPU_REG_TENFLOW_EN_POS))

/* 0x100 : BLAI_ACT_TABLE00 */
#define NPU_BLAI_ACT_TABLE00_OFFSET                             (0x100)
#define NPU_REG_ACT_TABLE_00                                    NPU_REG_ACT_TABLE_00
#define NPU_REG_ACT_TABLE_00_POS                                (0U)
#define NPU_REG_ACT_TABLE_00_LEN                                (8U)
#define NPU_REG_ACT_TABLE_00_MSK                                (((1U<<NPU_REG_ACT_TABLE_00_LEN)-1)<<NPU_REG_ACT_TABLE_00_POS)
#define NPU_REG_ACT_TABLE_00_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_00_LEN)-1)<<NPU_REG_ACT_TABLE_00_POS))
#define NPU_REG_ACT_TABLE_01                                    NPU_REG_ACT_TABLE_01
#define NPU_REG_ACT_TABLE_01_POS                                (8U)
#define NPU_REG_ACT_TABLE_01_LEN                                (8U)
#define NPU_REG_ACT_TABLE_01_MSK                                (((1U<<NPU_REG_ACT_TABLE_01_LEN)-1)<<NPU_REG_ACT_TABLE_01_POS)
#define NPU_REG_ACT_TABLE_01_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_01_LEN)-1)<<NPU_REG_ACT_TABLE_01_POS))
#define NPU_REG_ACT_TABLE_02                                    NPU_REG_ACT_TABLE_02
#define NPU_REG_ACT_TABLE_02_POS                                (16U)
#define NPU_REG_ACT_TABLE_02_LEN                                (8U)
#define NPU_REG_ACT_TABLE_02_MSK                                (((1U<<NPU_REG_ACT_TABLE_02_LEN)-1)<<NPU_REG_ACT_TABLE_02_POS)
#define NPU_REG_ACT_TABLE_02_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_02_LEN)-1)<<NPU_REG_ACT_TABLE_02_POS))
#define NPU_REG_ACT_TABLE_03                                    NPU_REG_ACT_TABLE_03
#define NPU_REG_ACT_TABLE_03_POS                                (24U)
#define NPU_REG_ACT_TABLE_03_LEN                                (8U)
#define NPU_REG_ACT_TABLE_03_MSK                                (((1U<<NPU_REG_ACT_TABLE_03_LEN)-1)<<NPU_REG_ACT_TABLE_03_POS)
#define NPU_REG_ACT_TABLE_03_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_03_LEN)-1)<<NPU_REG_ACT_TABLE_03_POS))

/* 0x104 : BLAI_ACT_TABLE07_04 */
#define NPU_BLAI_ACT_TABLE07_04_OFFSET                          (0x104)
#define NPU_REG_ACT_TABLE_04                                    NPU_REG_ACT_TABLE_04
#define NPU_REG_ACT_TABLE_04_POS                                (0U)
#define NPU_REG_ACT_TABLE_04_LEN                                (8U)
#define NPU_REG_ACT_TABLE_04_MSK                                (((1U<<NPU_REG_ACT_TABLE_04_LEN)-1)<<NPU_REG_ACT_TABLE_04_POS)
#define NPU_REG_ACT_TABLE_04_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_04_LEN)-1)<<NPU_REG_ACT_TABLE_04_POS))
#define NPU_REG_ACT_TABLE_05                                    NPU_REG_ACT_TABLE_05
#define NPU_REG_ACT_TABLE_05_POS                                (8U)
#define NPU_REG_ACT_TABLE_05_LEN                                (8U)
#define NPU_REG_ACT_TABLE_05_MSK                                (((1U<<NPU_REG_ACT_TABLE_05_LEN)-1)<<NPU_REG_ACT_TABLE_05_POS)
#define NPU_REG_ACT_TABLE_05_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_05_LEN)-1)<<NPU_REG_ACT_TABLE_05_POS))
#define NPU_REG_ACT_TABLE_06                                    NPU_REG_ACT_TABLE_06
#define NPU_REG_ACT_TABLE_06_POS                                (16U)
#define NPU_REG_ACT_TABLE_06_LEN                                (8U)
#define NPU_REG_ACT_TABLE_06_MSK                                (((1U<<NPU_REG_ACT_TABLE_06_LEN)-1)<<NPU_REG_ACT_TABLE_06_POS)
#define NPU_REG_ACT_TABLE_06_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_06_LEN)-1)<<NPU_REG_ACT_TABLE_06_POS))
#define NPU_REG_ACT_TABLE_07                                    NPU_REG_ACT_TABLE_07
#define NPU_REG_ACT_TABLE_07_POS                                (24U)
#define NPU_REG_ACT_TABLE_07_LEN                                (8U)
#define NPU_REG_ACT_TABLE_07_MSK                                (((1U<<NPU_REG_ACT_TABLE_07_LEN)-1)<<NPU_REG_ACT_TABLE_07_POS)
#define NPU_REG_ACT_TABLE_07_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_07_LEN)-1)<<NPU_REG_ACT_TABLE_07_POS))

/* 0x108 : BLAI_ACT_TABLE0B_08 */
#define NPU_BLAI_ACT_TABLE0B_08_OFFSET                          (0x108)
#define NPU_REG_ACT_TABLE_08                                    NPU_REG_ACT_TABLE_08
#define NPU_REG_ACT_TABLE_08_POS                                (0U)
#define NPU_REG_ACT_TABLE_08_LEN                                (8U)
#define NPU_REG_ACT_TABLE_08_MSK                                (((1U<<NPU_REG_ACT_TABLE_08_LEN)-1)<<NPU_REG_ACT_TABLE_08_POS)
#define NPU_REG_ACT_TABLE_08_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_08_LEN)-1)<<NPU_REG_ACT_TABLE_08_POS))
#define NPU_REG_ACT_TABLE_09                                    NPU_REG_ACT_TABLE_09
#define NPU_REG_ACT_TABLE_09_POS                                (8U)
#define NPU_REG_ACT_TABLE_09_LEN                                (8U)
#define NPU_REG_ACT_TABLE_09_MSK                                (((1U<<NPU_REG_ACT_TABLE_09_LEN)-1)<<NPU_REG_ACT_TABLE_09_POS)
#define NPU_REG_ACT_TABLE_09_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_09_LEN)-1)<<NPU_REG_ACT_TABLE_09_POS))
#define NPU_REG_ACT_TABLE_0A                                    NPU_REG_ACT_TABLE_0A
#define NPU_REG_ACT_TABLE_0A_POS                                (16U)
#define NPU_REG_ACT_TABLE_0A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_0A_MSK                                (((1U<<NPU_REG_ACT_TABLE_0A_LEN)-1)<<NPU_REG_ACT_TABLE_0A_POS)
#define NPU_REG_ACT_TABLE_0A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_0A_LEN)-1)<<NPU_REG_ACT_TABLE_0A_POS))
#define NPU_REG_ACT_TABLE_0B                                    NPU_REG_ACT_TABLE_0B
#define NPU_REG_ACT_TABLE_0B_POS                                (24U)
#define NPU_REG_ACT_TABLE_0B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_0B_MSK                                (((1U<<NPU_REG_ACT_TABLE_0B_LEN)-1)<<NPU_REG_ACT_TABLE_0B_POS)
#define NPU_REG_ACT_TABLE_0B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_0B_LEN)-1)<<NPU_REG_ACT_TABLE_0B_POS))

/* 0x10C : BLAI_ACT_TABLE0F_0C */
#define NPU_BLAI_ACT_TABLE0F_0C_OFFSET                          (0x10C)
#define NPU_REG_ACT_TABLE_0C                                    NPU_REG_ACT_TABLE_0C
#define NPU_REG_ACT_TABLE_0C_POS                                (0U)
#define NPU_REG_ACT_TABLE_0C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_0C_MSK                                (((1U<<NPU_REG_ACT_TABLE_0C_LEN)-1)<<NPU_REG_ACT_TABLE_0C_POS)
#define NPU_REG_ACT_TABLE_0C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_0C_LEN)-1)<<NPU_REG_ACT_TABLE_0C_POS))
#define NPU_REG_ACT_TABLE_0D                                    NPU_REG_ACT_TABLE_0D
#define NPU_REG_ACT_TABLE_0D_POS                                (8U)
#define NPU_REG_ACT_TABLE_0D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_0D_MSK                                (((1U<<NPU_REG_ACT_TABLE_0D_LEN)-1)<<NPU_REG_ACT_TABLE_0D_POS)
#define NPU_REG_ACT_TABLE_0D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_0D_LEN)-1)<<NPU_REG_ACT_TABLE_0D_POS))
#define NPU_REG_ACT_TABLE_0E                                    NPU_REG_ACT_TABLE_0E
#define NPU_REG_ACT_TABLE_0E_POS                                (16U)
#define NPU_REG_ACT_TABLE_0E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_0E_MSK                                (((1U<<NPU_REG_ACT_TABLE_0E_LEN)-1)<<NPU_REG_ACT_TABLE_0E_POS)
#define NPU_REG_ACT_TABLE_0E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_0E_LEN)-1)<<NPU_REG_ACT_TABLE_0E_POS))
#define NPU_REG_ACT_TABLE_0F                                    NPU_REG_ACT_TABLE_0F
#define NPU_REG_ACT_TABLE_0F_POS                                (24U)
#define NPU_REG_ACT_TABLE_0F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_0F_MSK                                (((1U<<NPU_REG_ACT_TABLE_0F_LEN)-1)<<NPU_REG_ACT_TABLE_0F_POS)
#define NPU_REG_ACT_TABLE_0F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_0F_LEN)-1)<<NPU_REG_ACT_TABLE_0F_POS))

