bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x110 : BLAI_ACT_TABLE13_10 */
#define NPU_BLAI_ACT_TABLE13_10_OFFSET                          (0x110)
#define NPU_REG_ACT_TABLE_10                                    NPU_REG_ACT_TABLE_10
#define NPU_REG_ACT_TABLE_10_POS                                (0U)
#define NPU_REG_ACT_TABLE_10_LEN                                (8U)
#define NPU_REG_ACT_TABLE_10_MSK                                (((1U<<NPU_REG_ACT_TABLE_10_LEN)-1)<<NPU_REG_ACT_TABLE_10_POS)
#define NPU_REG_ACT_TABLE_10_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_10_LEN)-1)<<NPU_REG_ACT_TABLE_10_POS))
#define NPU_REG_ACT_TABLE_11                                    NPU_REG_ACT_TABLE_11
#define NPU_REG_ACT_TABLE_11_POS                                (8U)
#define NPU_REG_ACT_TABLE_11_LEN                                (8U)
#define NPU_REG_ACT_TABLE_11_MSK                                (((1U<<NPU_REG_ACT_TABLE_11_LEN)-1)<<NPU_REG_ACT_TABLE_11_POS)
#define NPU_REG_ACT_TABLE_11_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_11_LEN)-1)<<NPU_REG_ACT_TABLE_11_POS))
#define NPU_REG_ACT_TABLE_12                                    NPU_REG_ACT_TABLE_12
#define NPU_REG_ACT_TABLE_12_POS                                (16U)
#define NPU_REG_ACT_TABLE_12_LEN                                (8U)
#define NPU_REG_ACT_TABLE_12_MSK                                (((1U<<NPU_REG_ACT_TABLE_12_LEN)-1)<<NPU_REG_ACT_TABLE_12_POS)
#define NPU_REG_ACT_TABLE_12_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_12_LEN)-1)<<NPU_REG_ACT_TABLE_12_POS))
#define NPU_REG_ACT_TABLE_13                                    NPU_REG_ACT_TABLE_13
#define NPU_REG_ACT_TABLE_13_POS                                (24U)
#define NPU_REG_ACT_TABLE_13_LEN                                (8U)
#define NPU_REG_ACT_TABLE_13_MSK                                (((1U<<NPU_REG_ACT_TABLE_13_LEN)-1)<<NPU_REG_ACT_TABLE_13_POS)
#define NPU_REG_ACT_TABLE_13_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_13_LEN)-1)<<NPU_REG_ACT_TABLE_13_POS))

/* 0x114 : BLAI_ACT_TABLE17_14 */
#define NPU_BLAI_ACT_TABLE17_14_OFFSET                          (0x114)
#define NPU_REG_ACT_TABLE_14                                    NPU_REG_ACT_TABLE_14
#define NPU_REG_ACT_TABLE_14_POS                                (0U)
#define NPU_REG_ACT_TABLE_14_LEN                                (8U)
#define NPU_REG_ACT_TABLE_14_MSK                                (((1U<<NPU_REG_ACT_TABLE_14_LEN)-1)<<NPU_REG_ACT_TABLE_14_POS)
#define NPU_REG_ACT_TABLE_14_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_14_LEN)-1)<<NPU_REG_ACT_TABLE_14_POS))
#define NPU_REG_ACT_TABLE_15                                    NPU_REG_ACT_TABLE_15
#define NPU_REG_ACT_TABLE_15_POS                                (8U)
#define NPU_REG_ACT_TABLE_15_LEN                                (8U)
#define NPU_REG_ACT_TABLE_15_MSK                                (((1U<<NPU_REG_ACT_TABLE_15_LEN)-1)<<NPU_REG_ACT_TABLE_15_POS)
#define NPU_REG_ACT_TABLE_15_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_15_LEN)-1)<<NPU_REG_ACT_TABLE_15_POS))
#define NPU_REG_ACT_TABLE_16                                    NPU_REG_ACT_TABLE_16
#define NPU_REG_ACT_TABLE_16_POS                                (16U)
#define NPU_REG_ACT_TABLE_16_LEN                                (8U)
#define NPU_REG_ACT_TABLE_16_MSK                                (((1U<<NPU_REG_ACT_TABLE_16_LEN)-1)<<NPU_REG_ACT_TABLE_16_POS)
#define NPU_REG_ACT_TABLE_16_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_16_LEN)-1)<<NPU_REG_ACT_TABLE_16_POS))
#define NPU_REG_ACT_TABLE_17                                    NPU_REG_ACT_TABLE_17
#define NPU_REG_ACT_TABLE_17_POS                                (24U)
#define NPU_REG_ACT_TABLE_17_LEN                                (8U)
#define NPU_REG_ACT_TABLE_17_MSK                                (((1U<<NPU_REG_ACT_TABLE_17_LEN)-1)<<NPU_REG_ACT_TABLE_17_POS)
#define NPU_REG_ACT_TABLE_17_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_17_LEN)-1)<<NPU_REG_ACT_TABLE_17_POS))

/* 0x118 : BLAI_ACT_TABLE1B_18 */
#define NPU_BLAI_ACT_TABLE1B_18_OFFSET                          (0x118)
#define NPU_REG_ACT_TABLE_18                                    NPU_REG_ACT_TABLE_18
#define NPU_REG_ACT_TABLE_18_POS                                (0U)
#define NPU_REG_ACT_TABLE_18_LEN                                (8U)
#define NPU_REG_ACT_TABLE_18_MSK                                (((1U<<NPU_REG_ACT_TABLE_18_LEN)-1)<<NPU_REG_ACT_TABLE_18_POS)
#define NPU_REG_ACT_TABLE_18_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_18_LEN)-1)<<NPU_REG_ACT_TABLE_18_POS))
#define NPU_REG_ACT_TABLE_19                                    NPU_REG_ACT_TABLE_19
#define NPU_REG_ACT_TABLE_19_POS                                (8U)
#define NPU_REG_ACT_TABLE_19_LEN                                (8U)
#define NPU_REG_ACT_TABLE_19_MSK                                (((1U<<NPU_REG_ACT_TABLE_19_LEN)-1)<<NPU_REG_ACT_TABLE_19_POS)
#define NPU_REG_ACT_TABLE_19_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_19_LEN)-1)<<NPU_REG_ACT_TABLE_19_POS))
#define NPU_REG_ACT_TABLE_1A                                    NPU_REG_ACT_TABLE_1A
#define NPU_REG_ACT_TABLE_1A_POS                                (16U)
#define NPU_REG_ACT_TABLE_1A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_1A_MSK                                (((1U<<NPU_REG_ACT_TABLE_1A_LEN)-1)<<NPU_REG_ACT_TABLE_1A_POS)
#define NPU_REG_ACT_TABLE_1A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_1A_LEN)-1)<<NPU_REG_ACT_TABLE_1A_POS))
#define NPU_REG_ACT_TABLE_1B                                    NPU_REG_ACT_TABLE_1B
#define NPU_REG_ACT_TABLE_1B_POS                                (24U)
#define NPU_REG_ACT_TABLE_1B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_1B_MSK                                (((1U<<NPU_REG_ACT_TABLE_1B_LEN)-1)<<NPU_REG_ACT_TABLE_1B_POS)
#define NPU_REG_ACT_TABLE_1B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_1B_LEN)-1)<<NPU_REG_ACT_TABLE_1B_POS))

