bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x11C : BLAI_ACT_TABLE1F_1C */
#define NPU_BLAI_ACT_TABLE1F_1C_OFFSET                          (0x11C)
#define NPU_REG_ACT_TABLE_1C                                    NPU_REG_ACT_TABLE_1C
#define NPU_REG_ACT_TABLE_1C_POS                                (0U)
#define NPU_REG_ACT_TABLE_1C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_1C_MSK                                (((1U<<NPU_REG_ACT_TABLE_1C_LEN)-1)<<NPU_REG_ACT_TABLE_1C_POS)
#define NPU_REG_ACT_TABLE_1C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_1C_LEN)-1)<<NPU_REG_ACT_TABLE_1C_POS))
#define NPU_REG_ACT_TABLE_1D                                    NPU_REG_ACT_TABLE_1D
#define NPU_REG_ACT_TABLE_1D_POS                                (8U)
#define NPU_REG_ACT_TABLE_1D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_1D_MSK                                (((1U<<NPU_REG_ACT_TABLE_1D_LEN)-1)<<NPU_REG_ACT_TABLE_1D_POS)
#define NPU_REG_ACT_TABLE_1D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_1D_LEN)-1)<<NPU_REG_ACT_TABLE_1D_POS))
#define NPU_REG_ACT_TABLE_1E                                    NPU_REG_ACT_TABLE_1E
#define NPU_REG_ACT_TABLE_1E_POS                                (16U)
#define NPU_REG_ACT_TABLE_1E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_1E_MSK                                (((1U<<NPU_REG_ACT_TABLE_1E_LEN)-1)<<NPU_REG_ACT_TABLE_1E_POS)
#define NPU_REG_ACT_TABLE_1E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_1E_LEN)-1)<<NPU_REG_ACT_TABLE_1E_POS))
#define NPU_REG_ACT_TABLE_1F                                    NPU_REG_ACT_TABLE_1F
#define NPU_REG_ACT_TABLE_1F_POS                                (24U)
#define NPU_REG_ACT_TABLE_1F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_1F_MSK                                (((1U<<NPU_REG_ACT_TABLE_1F_LEN)-1)<<NPU_REG_ACT_TABLE_1F_POS)
#define NPU_REG_ACT_TABLE_1F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_1F_LEN)-1)<<NPU_REG_ACT_TABLE_1F_POS))

/* 0x120 : BLAI_ACT_TABLE_23_20 */
#define NPU_BLAI_ACT_TABLE_23_20_OFFSET                         (0x120)
#define NPU_REG_ACT_TABLE_20                                    NPU_REG_ACT_TABLE_20
#define NPU_REG_ACT_TABLE_20_POS                                (0U)
#define NPU_REG_ACT_TABLE_20_LEN                                (8U)
#define NPU_REG_ACT_TABLE_20_MSK                                (((1U<<NPU_REG_ACT_TABLE_20_LEN)-1)<<NPU_REG_ACT_TABLE_20_POS)
#define NPU_REG_ACT_TABLE_20_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_20_LEN)-1)<<NPU_REG_ACT_TABLE_20_POS))
#define NPU_REG_ACT_TABLE_21                                    NPU_REG_ACT_TABLE_21
#define NPU_REG_ACT_TABLE_21_POS                                (8U)
#define NPU_REG_ACT_TABLE_21_LEN                                (8U)
#define NPU_REG_ACT_TABLE_21_MSK                                (((1U<<NPU_REG_ACT_TABLE_21_LEN)-1)<<NPU_REG_ACT_TABLE_21_POS)
#define NPU_REG_ACT_TABLE_21_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_21_LEN)-1)<<NPU_REG_ACT_TABLE_21_POS))
#define NPU_REG_ACT_TABLE_22                                    NPU_REG_ACT_TABLE_22
#define NPU_REG_ACT_TABLE_22_POS                                (16U)
#define NPU_REG_ACT_TABLE_22_LEN                                (8U)
#define NPU_REG_ACT_TABLE_22_MSK                                (((1U<<NPU_REG_ACT_TABLE_22_LEN)-1)<<NPU_REG_ACT_TABLE_22_POS)
#define NPU_REG_ACT_TABLE_22_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_22_LEN)-1)<<NPU_REG_ACT_TABLE_22_POS))
#define NPU_REG_ACT_TABLE_23                                    NPU_REG_ACT_TABLE_23
#define NPU_REG_ACT_TABLE_23_POS                                (24U)
#define NPU_REG_ACT_TABLE_23_LEN                                (8U)
#define NPU_REG_ACT_TABLE_23_MSK                                (((1U<<NPU_REG_ACT_TABLE_23_LEN)-1)<<NPU_REG_ACT_TABLE_23_POS)
#define NPU_REG_ACT_TABLE_23_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_23_LEN)-1)<<NPU_REG_ACT_TABLE_23_POS))

/* 0x124 : BLAI_ACT_TABLE_27_24 */
#define NPU_BLAI_ACT_TABLE_27_24_OFFSET                         (0x124)
#define NPU_REG_ACT_TABLE_24                                    NPU_REG_ACT_TABLE_24
#define NPU_REG_ACT_TABLE_24_POS                                (0U)
#define NPU_REG_ACT_TABLE_24_LEN                                (8U)
#define NPU_REG_ACT_TABLE_24_MSK                                (((1U<<NPU_REG_ACT_TABLE_24_LEN)-1)<<NPU_REG_ACT_TABLE_24_POS)
#define NPU_REG_ACT_TABLE_24_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_24_LEN)-1)<<NPU_REG_ACT_TABLE_24_POS))
#define NPU_REG_ACT_TABLE_25                                    NPU_REG_ACT_TABLE_25
#define NPU_REG_ACT_TABLE_25_POS                                (8U)
#define NPU_REG_ACT_TABLE_25_LEN                                (8U)
#define NPU_REG_ACT_TABLE_25_MSK                                (((1U<<NPU_REG_ACT_TABLE_25_LEN)-1)<<NPU_REG_ACT_TABLE_25_POS)
#define NPU_REG_ACT_TABLE_25_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_25_LEN)-1)<<NPU_REG_ACT_TABLE_25_POS))
#define NPU_REG_ACT_TABLE_26                                    NPU_REG_ACT_TABLE_26
#define NPU_REG_ACT_TABLE_26_POS                                (16U)
#define NPU_REG_ACT_TABLE_26_LEN                                (8U)
#define NPU_REG_ACT_TABLE_26_MSK                                (((1U<<NPU_REG_ACT_TABLE_26_LEN)-1)<<NPU_REG_ACT_TABLE_26_POS)
#define NPU_REG_ACT_TABLE_26_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_26_LEN)-1)<<NPU_REG_ACT_TABLE_26_POS))
#define NPU_REG_ACT_TABLE_27                                    NPU_REG_ACT_TABLE_27
#define NPU_REG_ACT_TABLE_27_POS                                (24U)
#define NPU_REG_ACT_TABLE_27_LEN                                (8U)
#define NPU_REG_ACT_TABLE_27_MSK                                (((1U<<NPU_REG_ACT_TABLE_27_LEN)-1)<<NPU_REG_ACT_TABLE_27_POS)
#define NPU_REG_ACT_TABLE_27_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_27_LEN)-1)<<NPU_REG_ACT_TABLE_27_POS))

/* 0x128 : BLAI_ACT_TABLE_2B_28 */
#define NPU_BLAI_ACT_TABLE_2B_28_OFFSET                         (0x128)
#define NPU_REG_ACT_TABLE_28                                    NPU_REG_ACT_TABLE_28
#define NPU_REG_ACT_TABLE_28_POS                                (0U)
#define NPU_REG_ACT_TABLE_28_LEN                                (8U)
#define NPU_REG_ACT_TABLE_28_MSK                                (((1U<<NPU_REG_ACT_TABLE_28_LEN)-1)<<NPU_REG_ACT_TABLE_28_POS)
#define NPU_REG_ACT_TABLE_28_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_28_LEN)-1)<<NPU_REG_ACT_TABLE_28_POS))
#define NPU_REG_ACT_TABLE_29                                    NPU_REG_ACT_TABLE_29
#define NPU_REG_ACT_TABLE_29_POS                                (8U)
#define NPU_REG_ACT_TABLE_29_LEN                                (8U)
#define NPU_REG_ACT_TABLE_29_MSK                                (((1U<<NPU_REG_ACT_TABLE_29_LEN)-1)<<NPU_REG_ACT_TABLE_29_POS)
#define NPU_REG_ACT_TABLE_29_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_29_LEN)-1)<<NPU_REG_ACT_TABLE_29_POS))
#define NPU_REG_ACT_TABLE_2A                                    NPU_REG_ACT_TABLE_2A
#define NPU_REG_ACT_TABLE_2A_POS                                (16U)
#define NPU_REG_ACT_TABLE_2A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_2A_MSK                                (((1U<<NPU_REG_ACT_TABLE_2A_LEN)-1)<<NPU_REG_ACT_TABLE_2A_POS)
#define NPU_REG_ACT_TABLE_2A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_2A_LEN)-1)<<NPU_REG_ACT_TABLE_2A_POS))
#define NPU_REG_ACT_TABLE_2B                                    NPU_REG_ACT_TABLE_2B
#define NPU_REG_ACT_TABLE_2B_POS                                (24U)
#define NPU_REG_ACT_TABLE_2B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_2B_MSK                                (((1U<<NPU_REG_ACT_TABLE_2B_LEN)-1)<<NPU_REG_ACT_TABLE_2B_POS)
#define NPU_REG_ACT_TABLE_2B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_2B_LEN)-1)<<NPU_REG_ACT_TABLE_2B_POS))

/* 0x12C : BLAI_ACT_TABLE_2F_2C */
#define NPU_BLAI_ACT_TABLE_2F_2C_OFFSET                         (0x12C)
#define NPU_REG_ACT_TABLE_2C                                    NPU_REG_ACT_TABLE_2C
#define NPU_REG_ACT_TABLE_2C_POS                                (0U)
#define NPU_REG_ACT_TABLE_2C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_2C_MSK                                (((1U<<NPU_REG_ACT_TABLE_2C_LEN)-1)<<NPU_REG_ACT_TABLE_2C_POS)
#define NPU_REG_ACT_TABLE_2C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_2C_LEN)-1)<<NPU_REG_ACT_TABLE_2C_POS))
#define NPU_REG_ACT_TABLE_2D                                    NPU_REG_ACT_TABLE_2D
#define NPU_REG_ACT_TABLE_2D_POS                                (8U)
#define NPU_REG_ACT_TABLE_2D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_2D_MSK                                (((1U<<NPU_REG_ACT_TABLE_2D_LEN)-1)<<NPU_REG_ACT_TABLE_2D_POS)
#define NPU_REG_ACT_TABLE_2D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_2D_LEN)-1)<<NPU_REG_ACT_TABLE_2D_POS))
#define NPU_REG_ACT_TABLE_2E                                    NPU_REG_ACT_TABLE_2E
#define NPU_REG_ACT_TABLE_2E_POS                                (16U)
#define NPU_REG_ACT_TABLE_2E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_2E_MSK                                (((1U<<NPU_REG_ACT_TABLE_2E_LEN)-1)<<NPU_REG_ACT_TABLE_2E_POS)
#define NPU_REG_ACT_TABLE_2E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_2E_LEN)-1)<<NPU_REG_ACT_TABLE_2E_POS))
#define NPU_REG_ACT_TABLE_2F                                    NPU_REG_ACT_TABLE_2F
#define NPU_REG_ACT_TABLE_2F_POS                                (24U)
#define NPU_REG_ACT_TABLE_2F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_2F_MSK                                (((1U<<NPU_REG_ACT_TABLE_2F_LEN)-1)<<NPU_REG_ACT_TABLE_2F_POS)
#define NPU_REG_ACT_TABLE_2F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_2F_LEN)-1)<<NPU_REG_ACT_TABLE_2F_POS))

/* 0x130 : BLAI_ACT_TABLE_33_30 */
#define NPU_BLAI_ACT_TABLE_33_30_OFFSET                         (0x130)
#define NPU_REG_ACT_TABLE_30                                    NPU_REG_ACT_TABLE_30
#define NPU_REG_ACT_TABLE_30_POS                                (0U)
#define NPU_REG_ACT_TABLE_30_LEN                                (8U)
#define NPU_REG_ACT_TABLE_30_MSK                                (((1U<<NPU_REG_ACT_TABLE_30_LEN)-1)<<NPU_REG_ACT_TABLE_30_POS)
#define NPU_REG_ACT_TABLE_30_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_30_LEN)-1)<<NPU_REG_ACT_TABLE_30_POS))
#define NPU_REG_ACT_TABLE_31                                    NPU_REG_ACT_TABLE_31
#define NPU_REG_ACT_TABLE_31_POS                                (8U)
#define NPU_REG_ACT_TABLE_31_LEN                                (8U)
#define NPU_REG_ACT_TABLE_31_MSK                                (((1U<<NPU_REG_ACT_TABLE_31_LEN)-1)<<NPU_REG_ACT_TABLE_31_POS)
#define NPU_REG_ACT_TABLE_31_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_31_LEN)-1)<<NPU_REG_ACT_TABLE_31_POS))
#define NPU_REG_ACT_TABLE_32                                    NPU_REG_ACT_TABLE_32
#define NPU_REG_ACT_TABLE_32_POS                                (16U)
#define NPU_REG_ACT_TABLE_32_LEN                                (8U)
#define NPU_REG_ACT_TABLE_32_MSK                                (((1U<<NPU_REG_ACT_TABLE_32_LEN)-1)<<NPU_REG_ACT_TABLE_32_POS)
#define NPU_REG_ACT_TABLE_32_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_32_LEN)-1)<<NPU_REG_ACT_TABLE_32_POS))
#define NPU_REG_ACT_TABLE_33                                    NPU_REG_ACT_TABLE_33
#define NPU_REG_ACT_TABLE_33_POS                                (24U)
#define NPU_REG_ACT_TABLE_33_LEN                                (8U)
#define NPU_REG_ACT_TABLE_33_MSK                                (((1U<<NPU_REG_ACT_TABLE_33_LEN)-1)<<NPU_REG_ACT_TABLE_33_POS)
#define NPU_REG_ACT_TABLE_33_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_33_LEN)-1)<<NPU_REG_ACT_TABLE_33_POS))

/* 0x134 : BLAI_ACT_TABLE_37_34 */
#define NPU_BLAI_ACT_TABLE_37_34_OFFSET                         (0x134)
#define NPU_REG_ACT_TABLE_34                                    NPU_REG_ACT_TABLE_34
#define NPU_REG_ACT_TABLE_34_POS                                (0U)
#define NPU_REG_ACT_TABLE_34_LEN                                (8U)
#define NPU_REG_ACT_TABLE_34_MSK                                (((1U<<NPU_REG_ACT_TABLE_34_LEN)-1)<<NPU_REG_ACT_TABLE_34_POS)
#define NPU_REG_ACT_TABLE_34_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_34_LEN)-1)<<NPU_REG_ACT_TABLE_34_POS))
#define NPU_REG_ACT_TABLE_35                                    NPU_REG_ACT_TABLE_35
#define NPU_REG_ACT_TABLE_35_POS                                (8U)
#define NPU_REG_ACT_TABLE_35_LEN                                (8U)
#define NPU_REG_ACT_TABLE_35_MSK                                (((1U<<NPU_REG_ACT_TABLE_35_LEN)-1)<<NPU_REG_ACT_TABLE_35_POS)
#define NPU_REG_ACT_TABLE_35_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_35_LEN)-1)<<NPU_REG_ACT_TABLE_35_POS))
#define NPU_REG_ACT_TABLE_36                                    NPU_REG_ACT_TABLE_36
#define NPU_REG_ACT_TABLE_36_POS                                (16U)
#define NPU_REG_ACT_TABLE_36_LEN                                (8U)
#define NPU_REG_ACT_TABLE_36_MSK                                (((1U<<NPU_REG_ACT_TABLE_36_LEN)-1)<<NPU_REG_ACT_TABLE_36_POS)
#define NPU_REG_ACT_TABLE_36_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_36_LEN)-1)<<NPU_REG_ACT_TABLE_36_POS))
#define NPU_REG_ACT_TABLE_37                                    NPU_REG_ACT_TABLE_37
#define NPU_REG_ACT_TABLE_37_POS                                (24U)
#define NPU_REG_ACT_TABLE_37_LEN                                (8U)
#define NPU_REG_ACT_TABLE_37_MSK                                (((1U<<NPU_REG_ACT_TABLE_37_LEN)-1)<<NPU_REG_ACT_TABLE_37_POS)
#define NPU_REG_ACT_TABLE_37_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_37_LEN)-1)<<NPU_REG_ACT_TABLE_37_POS))

