bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x138 : BLAI_ACT_TABLE_3B_38 */
#define NPU_BLAI_ACT_TABLE_3B_38_OFFSET                         (0x138)
#define NPU_REG_ACT_TABLE_38                                    NPU_REG_ACT_TABLE_38
#define NPU_REG_ACT_TABLE_38_POS                                (0U)
#define NPU_REG_ACT_TABLE_38_LEN                                (8U)
#define NPU_REG_ACT_TABLE_38_MSK                                (((1U<<NPU_REG_ACT_TABLE_38_LEN)-1)<<NPU_REG_ACT_TABLE_38_POS)
#define NPU_REG_ACT_TABLE_38_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_38_LEN)-1)<<NPU_REG_ACT_TABLE_38_POS))
#define NPU_REG_ACT_TABLE_39                                    NPU_REG_ACT_TABLE_39
#define NPU_REG_ACT_TABLE_39_POS                                (8U)
#define NPU_REG_ACT_TABLE_39_LEN                                (8U)
#define NPU_REG_ACT_TABLE_39_MSK                                (((1U<<NPU_REG_ACT_TABLE_39_LEN)-1)<<NPU_REG_ACT_TABLE_39_POS)
#define NPU_REG_ACT_TABLE_39_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_39_LEN)-1)<<NPU_REG_ACT_TABLE_39_POS))
#define NPU_REG_ACT_TABLE_3A                                    NPU_REG_ACT_TABLE_3A
#define NPU_REG_ACT_TABLE_3A_POS                                (16U)
#define NPU_REG_ACT_TABLE_3A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_3A_MSK                                (((1U<<NPU_REG_ACT_TABLE_3A_LEN)-1)<<NPU_REG_ACT_TABLE_3A_POS)
#define NPU_REG_ACT_TABLE_3A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_3A_LEN)-1)<<NPU_REG_ACT_TABLE_3A_POS))
#define NPU_REG_ACT_TABLE_3B                                    NPU_REG_ACT_TABLE_3B
#define NPU_REG_ACT_TABLE_3B_POS                                (24U)
#define NPU_REG_ACT_TABLE_3B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_3B_MSK                                (((1U<<NPU_REG_ACT_TABLE_3B_LEN)-1)<<NPU_REG_ACT_TABLE_3B_POS)
#define NPU_REG_ACT_TABLE_3B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_3B_LEN)-1)<<NPU_REG_ACT_TABLE_3B_POS))

/* 0x13C : BLAI_ACT_TABLE_3F_3C */
#define NPU_BLAI_ACT_TABLE_3F_3C_OFFSET                         (0x13C)
#define NPU_REG_ACT_TABLE_3C                                    NPU_REG_ACT_TABLE_3C
#define NPU_REG_ACT_TABLE_3C_POS                                (0U)
#define NPU_REG_ACT_TABLE_3C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_3C_MSK                                (((1U<<NPU_REG_ACT_TABLE_3C_LEN)-1)<<NPU_REG_ACT_TABLE_3C_POS)
#define NPU_REG_ACT_TABLE_3C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_3C_LEN)-1)<<NPU_REG_ACT_TABLE_3C_POS))
#define NPU_REG_ACT_TABLE_3D                                    NPU_REG_ACT_TABLE_3D
#define NPU_REG_ACT_TABLE_3D_POS                                (8U)
#define NPU_REG_ACT_TABLE_3D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_3D_MSK                                (((1U<<NPU_REG_ACT_TABLE_3D_LEN)-1)<<NPU_REG_ACT_TABLE_3D_POS)
#define NPU_REG_ACT_TABLE_3D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_3D_LEN)-1)<<NPU_REG_ACT_TABLE_3D_POS))
#define NPU_REG_ACT_TABLE_3E                                    NPU_REG_ACT_TABLE_3E
#define NPU_REG_ACT_TABLE_3E_POS                                (16U)
#define NPU_REG_ACT_TABLE_3E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_3E_MSK                                (((1U<<NPU_REG_ACT_TABLE_3E_LEN)-1)<<NPU_REG_ACT_TABLE_3E_POS)
#define NPU_REG_ACT_TABLE_3E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_3E_LEN)-1)<<NPU_REG_ACT_TABLE_3E_POS))
#define NPU_REG_ACT_TABLE_3F                                    NPU_REG_ACT_TABLE_3F
#define NPU_REG_ACT_TABLE_3F_POS                                (24U)
#define NPU_REG_ACT_TABLE_3F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_3F_MSK                                (((1U<<NPU_REG_ACT_TABLE_3F_LEN)-1)<<NPU_REG_ACT_TABLE_3F_POS)
#define NPU_REG_ACT_TABLE_3F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_3F_LEN)-1)<<NPU_REG_ACT_TABLE_3F_POS))

/* 0x140 : BLAI_ACT_TABLE_43_40 */
#define NPU_BLAI_ACT_TABLE_43_40_OFFSET                         (0x140)
#define NPU_REG_ACT_TABLE_40                                    NPU_REG_ACT_TABLE_40
#define NPU_REG_ACT_TABLE_40_POS                                (0U)
#define NPU_REG_ACT_TABLE_40_LEN                                (8U)
#define NPU_REG_ACT_TABLE_40_MSK                                (((1U<<NPU_REG_ACT_TABLE_40_LEN)-1)<<NPU_REG_ACT_TABLE_40_POS)
#define NPU_REG_ACT_TABLE_40_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_40_LEN)-1)<<NPU_REG_ACT_TABLE_40_POS))
#define NPU_REG_ACT_TABLE_41                                    NPU_REG_ACT_TABLE_41
#define NPU_REG_ACT_TABLE_41_POS                                (8U)
#define NPU_REG_ACT_TABLE_41_LEN                                (8U)
#define NPU_REG_ACT_TABLE_41_MSK                                (((1U<<NPU_REG_ACT_TABLE_41_LEN)-1)<<NPU_REG_ACT_TABLE_41_POS)
#define NPU_REG_ACT_TABLE_41_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_41_LEN)-1)<<NPU_REG_ACT_TABLE_41_POS))
#define NPU_REG_ACT_TABLE_42                                    NPU_REG_ACT_TABLE_42
#define NPU_REG_ACT_TABLE_42_POS                                (16U)
#define NPU_REG_ACT_TABLE_42_LEN                                (8U)
#define NPU_REG_ACT_TABLE_42_MSK                                (((1U<<NPU_REG_ACT_TABLE_42_LEN)-1)<<NPU_REG_ACT_TABLE_42_POS)
#define NPU_REG_ACT_TABLE_42_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_42_LEN)-1)<<NPU_REG_ACT_TABLE_42_POS))
#define NPU_REG_ACT_TABLE_43                                    NPU_REG_ACT_TABLE_43
#define NPU_REG_ACT_TABLE_43_POS                                (24U)
#define NPU_REG_ACT_TABLE_43_LEN                                (8U)
#define NPU_REG_ACT_TABLE_43_MSK                                (((1U<<NPU_REG_ACT_TABLE_43_LEN)-1)<<NPU_REG_ACT_TABLE_43_POS)
#define NPU_REG_ACT_TABLE_43_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_43_LEN)-1)<<NPU_REG_ACT_TABLE_43_POS))

/* 0x144 : BLAI_ACT_TABLE_47_44 */
#define NPU_BLAI_ACT_TABLE_47_44_OFFSET                         (0x144)
#define NPU_REG_ACT_TABLE_44                                    NPU_REG_ACT_TABLE_44
#define NPU_REG_ACT_TABLE_44_POS                                (0U)
#define NPU_REG_ACT_TABLE_44_LEN                                (8U)
#define NPU_REG_ACT_TABLE_44_MSK                                (((1U<<NPU_REG_ACT_TABLE_44_LEN)-1)<<NPU_REG_ACT_TABLE_44_POS)
#define NPU_REG_ACT_TABLE_44_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_44_LEN)-1)<<NPU_REG_ACT_TABLE_44_POS))
#define NPU_REG_ACT_TABLE_45                                    NPU_REG_ACT_TABLE_45
#define NPU_REG_ACT_TABLE_45_POS                                (8U)
#define NPU_REG_ACT_TABLE_45_LEN                                (8U)
#define NPU_REG_ACT_TABLE_45_MSK                                (((1U<<NPU_REG_ACT_TABLE_45_LEN)-1)<<NPU_REG_ACT_TABLE_45_POS)
#define NPU_REG_ACT_TABLE_45_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_45_LEN)-1)<<NPU_REG_ACT_TABLE_45_POS))
#define NPU_REG_ACT_TABLE_46                                    NPU_REG_ACT_TABLE_46
#define NPU_REG_ACT_TABLE_46_POS                                (16U)
#define NPU_REG_ACT_TABLE_46_LEN                                (8U)
#define NPU_REG_ACT_TABLE_46_MSK                                (((1U<<NPU_REG_ACT_TABLE_46_LEN)-1)<<NPU_REG_ACT_TABLE_46_POS)
#define NPU_REG_ACT_TABLE_46_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_46_LEN)-1)<<NPU_REG_ACT_TABLE_46_POS))
#define NPU_REG_ACT_TABLE_47                                    NPU_REG_ACT_TABLE_47
#define NPU_REG_ACT_TABLE_47_POS                                (24U)
#define NPU_REG_ACT_TABLE_47_LEN                                (8U)
#define NPU_REG_ACT_TABLE_47_MSK                                (((1U<<NPU_REG_ACT_TABLE_47_LEN)-1)<<NPU_REG_ACT_TABLE_47_POS)
#define NPU_REG_ACT_TABLE_47_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_47_LEN)-1)<<NPU_REG_ACT_TABLE_47_POS))

/* 0x148 : BLAI_ACT_TABLE_4B_48 */
#define NPU_BLAI_ACT_TABLE_4B_48_OFFSET                         (0x148)
#define NPU_REG_ACT_TABLE_48                                    NPU_REG_ACT_TABLE_48
#define NPU_REG_ACT_TABLE_48_POS                                (0U)
#define NPU_REG_ACT_TABLE_48_LEN                                (8U)
#define NPU_REG_ACT_TABLE_48_MSK                                (((1U<<NPU_REG_ACT_TABLE_48_LEN)-1)<<NPU_REG_ACT_TABLE_48_POS)
#define NPU_REG_ACT_TABLE_48_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_48_LEN)-1)<<NPU_REG_ACT_TABLE_48_POS))
#define NPU_REG_ACT_TABLE_49                                    NPU_REG_ACT_TABLE_49
#define NPU_REG_ACT_TABLE_49_POS                                (8U)
#define NPU_REG_ACT_TABLE_49_LEN                                (8U)
#define NPU_REG_ACT_TABLE_49_MSK                                (((1U<<NPU_REG_ACT_TABLE_49_LEN)-1)<<NPU_REG_ACT_TABLE_49_POS)
#define NPU_REG_ACT_TABLE_49_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_49_LEN)-1)<<NPU_REG_ACT_TABLE_49_POS))
#define NPU_REG_ACT_TABLE_4A                                    NPU_REG_ACT_TABLE_4A
#define NPU_REG_ACT_TABLE_4A_POS                                (16U)
#define NPU_REG_ACT_TABLE_4A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_4A_MSK                                (((1U<<NPU_REG_ACT_TABLE_4A_LEN)-1)<<NPU_REG_ACT_TABLE_4A_POS)
#define NPU_REG_ACT_TABLE_4A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_4A_LEN)-1)<<NPU_REG_ACT_TABLE_4A_POS))
#define NPU_REG_ACT_TABLE_4B                                    NPU_REG_ACT_TABLE_4B
#define NPU_REG_ACT_TABLE_4B_POS                                (24U)
#define NPU_REG_ACT_TABLE_4B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_4B_MSK                                (((1U<<NPU_REG_ACT_TABLE_4B_LEN)-1)<<NPU_REG_ACT_TABLE_4B_POS)
#define NPU_REG_ACT_TABLE_4B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_4B_LEN)-1)<<NPU_REG_ACT_TABLE_4B_POS))

/* 0x14C : BLAI_ACT_TABLE_4F_4C */
#define NPU_BLAI_ACT_TABLE_4F_4C_OFFSET                         (0x14C)
#define NPU_REG_ACT_TABLE_4C                                    NPU_REG_ACT_TABLE_4C
#define NPU_REG_ACT_TABLE_4C_POS                                (0U)
#define NPU_REG_ACT_TABLE_4C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_4C_MSK                                (((1U<<NPU_REG_ACT_TABLE_4C_LEN)-1)<<NPU_REG_ACT_TABLE_4C_POS)
#define NPU_REG_ACT_TABLE_4C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_4C_LEN)-1)<<NPU_REG_ACT_TABLE_4C_POS))
#define NPU_REG_ACT_TABLE_4D                                    NPU_REG_ACT_TABLE_4D
#define NPU_REG_ACT_TABLE_4D_POS                                (8U)
#define NPU_REG_ACT_TABLE_4D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_4D_MSK                                (((1U<<NPU_REG_ACT_TABLE_4D_LEN)-1)<<NPU_REG_ACT_TABLE_4D_POS)
#define NPU_REG_ACT_TABLE_4D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_4D_LEN)-1)<<NPU_REG_ACT_TABLE_4D_POS))
#define NPU_REG_ACT_TABLE_4E                                    NPU_REG_ACT_TABLE_4E
#define NPU_REG_ACT_TABLE_4E_POS                                (16U)
#define NPU_REG_ACT_TABLE_4E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_4E_MSK                                (((1U<<NPU_REG_ACT_TABLE_4E_LEN)-1)<<NPU_REG_ACT_TABLE_4E_POS)
#define NPU_REG_ACT_TABLE_4E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_4E_LEN)-1)<<NPU_REG_ACT_TABLE_4E_POS))
#define NPU_REG_ACT_TABLE_4F                                    NPU_REG_ACT_TABLE_4F
#define NPU_REG_ACT_TABLE_4F_POS                                (24U)
#define NPU_REG_ACT_TABLE_4F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_4F_MSK                                (((1U<<NPU_REG_ACT_TABLE_4F_LEN)-1)<<NPU_REG_ACT_TABLE_4F_POS)
#define NPU_REG_ACT_TABLE_4F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_4F_LEN)-1)<<NPU_REG_ACT_TABLE_4F_POS))

/* 0x150 : BLAI_ACT_TABLE_53_50 */
#define NPU_BLAI_ACT_TABLE_53_50_OFFSET                         (0x150)
#define NPU_REG_ACT_TABLE_50                                    NPU_REG_ACT_TABLE_50
#define NPU_REG_ACT_TABLE_50_POS                                (0U)
#define NPU_REG_ACT_TABLE_50_LEN                                (8U)
#define NPU_REG_ACT_TABLE_50_MSK                                (((1U<<NPU_REG_ACT_TABLE_50_LEN)-1)<<NPU_REG_ACT_TABLE_50_POS)
#define NPU_REG_ACT_TABLE_50_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_50_LEN)-1)<<NPU_REG_ACT_TABLE_50_POS))
#define NPU_REG_ACT_TABLE_51                                    NPU_REG_ACT_TABLE_51
#define NPU_REG_ACT_TABLE_51_POS                                (8U)
#define NPU_REG_ACT_TABLE_51_LEN                                (8U)
#define NPU_REG_ACT_TABLE_51_MSK                                (((1U<<NPU_REG_ACT_TABLE_51_LEN)-1)<<NPU_REG_ACT_TABLE_51_POS)
#define NPU_REG_ACT_TABLE_51_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_51_LEN)-1)<<NPU_REG_ACT_TABLE_51_POS))
#define NPU_REG_ACT_TABLE_52                                    NPU_REG_ACT_TABLE_52
#define NPU_REG_ACT_TABLE_52_POS                                (16U)
#define NPU_REG_ACT_TABLE_52_LEN                                (8U)
#define NPU_REG_ACT_TABLE_52_MSK                                (((1U<<NPU_REG_ACT_TABLE_52_LEN)-1)<<NPU_REG_ACT_TABLE_52_POS)
#define NPU_REG_ACT_TABLE_52_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_52_LEN)-1)<<NPU_REG_ACT_TABLE_52_POS))
#define NPU_REG_ACT_TABLE_53                                    NPU_REG_ACT_TABLE_53
#define NPU_REG_ACT_TABLE_53_POS                                (24U)
#define NPU_REG_ACT_TABLE_53_LEN                                (8U)
#define NPU_REG_ACT_TABLE_53_MSK                                (((1U<<NPU_REG_ACT_TABLE_53_LEN)-1)<<NPU_REG_ACT_TABLE_53_POS)
#define NPU_REG_ACT_TABLE_53_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_53_LEN)-1)<<NPU_REG_ACT_TABLE_53_POS))

/* 0x154 : BLAI_ACT_TABLE_57_54 */
#define NPU_BLAI_ACT_TABLE_57_54_OFFSET                         (0x154)
#define NPU_REG_ACT_TABLE_54                                    NPU_REG_ACT_TABLE_54
#define NPU_REG_ACT_TABLE_54_POS                                (0U)
#define NPU_REG_ACT_TABLE_54_LEN                                (8U)
#define NPU_REG_ACT_TABLE_54_MSK                                (((1U<<NPU_REG_ACT_TABLE_54_LEN)-1)<<NPU_REG_ACT_TABLE_54_POS)
#define NPU_REG_ACT_TABLE_54_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_54_LEN)-1)<<NPU_REG_ACT_TABLE_54_POS))
#define NPU_REG_ACT_TABLE_55                                    NPU_REG_ACT_TABLE_55
#define NPU_REG_ACT_TABLE_55_POS                                (8U)
#define NPU_REG_ACT_TABLE_55_LEN                                (8U)
#define NPU_REG_ACT_TABLE_55_MSK                                (((1U<<NPU_REG_ACT_TABLE_55_LEN)-1)<<NPU_REG_ACT_TABLE_55_POS)
#define NPU_REG_ACT_TABLE_55_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_55_LEN)-1)<<NPU_REG_ACT_TABLE_55_POS))
#define NPU_REG_ACT_TABLE_56                                    NPU_REG_ACT_TABLE_56
#define NPU_REG_ACT_TABLE_56_POS                                (16U)
#define NPU_REG_ACT_TABLE_56_LEN                                (8U)
#define NPU_REG_ACT_TABLE_56_MSK                                (((1U<<NPU_REG_ACT_TABLE_56_LEN)-1)<<NPU_REG_ACT_TABLE_56_POS)
#define NPU_REG_ACT_TABLE_56_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_56_LEN)-1)<<NPU_REG_ACT_TABLE_56_POS))
#define NPU_REG_ACT_TABLE_57                                    NPU_REG_ACT_TABLE_57
#define NPU_REG_ACT_TABLE_57_POS                                (24U)
#define NPU_REG_ACT_TABLE_57_LEN                                (8U)
#define NPU_REG_ACT_TABLE_57_MSK                                (((1U<<NPU_REG_ACT_TABLE_57_LEN)-1)<<NPU_REG_ACT_TABLE_57_POS)
#define NPU_REG_ACT_TABLE_57_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_57_LEN)-1)<<NPU_REG_ACT_TABLE_57_POS))

/* 0x158 : BLAI_ACT_TABLE_5B_58 */
#define NPU_BLAI_ACT_TABLE_5B_58_OFFSET                         (0x158)
#define NPU_REG_ACT_TABLE_58                                    NPU_REG_ACT_TABLE_58
#define NPU_REG_ACT_TABLE_58_POS                                (0U)
#define NPU_REG_ACT_TABLE_58_LEN                                (8U)
#define NPU_REG_ACT_TABLE_58_MSK                                (((1U<<NPU_REG_ACT_TABLE_58_LEN)-1)<<NPU_REG_ACT_TABLE_58_POS)
#define NPU_REG_ACT_TABLE_58_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_58_LEN)-1)<<NPU_REG_ACT_TABLE_58_POS))
#define NPU_REG_ACT_TABLE_59                                    NPU_REG_ACT_TABLE_59
#define NPU_REG_ACT_TABLE_59_POS                                (8U)
#define NPU_REG_ACT_TABLE_59_LEN                                (8U)
#define NPU_REG_ACT_TABLE_59_MSK                                (((1U<<NPU_REG_ACT_TABLE_59_LEN)-1)<<NPU_REG_ACT_TABLE_59_POS)
#define NPU_REG_ACT_TABLE_59_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_59_LEN)-1)<<NPU_REG_ACT_TABLE_59_POS))
#define NPU_REG_ACT_TABLE_5A                                    NPU_REG_ACT_TABLE_5A
#define NPU_REG_ACT_TABLE_5A_POS                                (16U)
#define NPU_REG_ACT_TABLE_5A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_5A_MSK                                (((1U<<NPU_REG_ACT_TABLE_5A_LEN)-1)<<NPU_REG_ACT_TABLE_5A_POS)
#define NPU_REG_ACT_TABLE_5A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_5A_LEN)-1)<<NPU_REG_ACT_TABLE_5A_POS))
#define NPU_REG_ACT_TABLE_5B                                    NPU_REG_ACT_TABLE_5B
#define NPU_REG_ACT_TABLE_5B_POS                                (24U)
#define NPU_REG_ACT_TABLE_5B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_5B_MSK                                (((1U<<NPU_REG_ACT_TABLE_5B_LEN)-1)<<NPU_REG_ACT_TABLE_5B_POS)
#define NPU_REG_ACT_TABLE_5B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_5B_LEN)-1)<<NPU_REG_ACT_TABLE_5B_POS))

