bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x15C : BLAI_ACT_TABLE_5F_5C */
#define NPU_BLAI_ACT_TABLE_5F_5C_OFFSET                         (0x15C)
#define NPU_REG_ACT_TABLE_5C                                    NPU_REG_ACT_TABLE_5C
#define NPU_REG_ACT_TABLE_5C_POS                                (0U)
#define NPU_REG_ACT_TABLE_5C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_5C_MSK                                (((1U<<NPU_REG_ACT_TABLE_5C_LEN)-1)<<NPU_REG_ACT_TABLE_5C_POS)
#define NPU_REG_ACT_TABLE_5C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_5C_LEN)-1)<<NPU_REG_ACT_TABLE_5C_POS))
#define NPU_REG_ACT_TABLE_5D                                    NPU_REG_ACT_TABLE_5D
#define NPU_REG_ACT_TABLE_5D_POS                                (8U)
#define NPU_REG_ACT_TABLE_5D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_5D_MSK                                (((1U<<NPU_REG_ACT_TABLE_5D_LEN)-1)<<NPU_REG_ACT_TABLE_5D_POS)
#define NPU_REG_ACT_TABLE_5D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_5D_LEN)-1)<<NPU_REG_ACT_TABLE_5D_POS))
#define NPU_REG_ACT_TABLE_5E                                    NPU_REG_ACT_TABLE_5E
#define NPU_REG_ACT_TABLE_5E_POS                                (16U)
#define NPU_REG_ACT_TABLE_5E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_5E_MSK                                (((1U<<NPU_REG_ACT_TABLE_5E_LEN)-1)<<NPU_REG_ACT_TABLE_5E_POS)
#define NPU_REG_ACT_TABLE_5E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_5E_LEN)-1)<<NPU_REG_ACT_TABLE_5E_POS))
#define NPU_REG_ACT_TABLE_5F                                    NPU_REG_ACT_TABLE_5F
#define NPU_REG_ACT_TABLE_5F_POS                                (24U)
#define NPU_REG_ACT_TABLE_5F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_5F_MSK                                (((1U<<NPU_REG_ACT_TABLE_5F_LEN)-1)<<NPU_REG_ACT_TABLE_5F_POS)
#define NPU_REG_ACT_TABLE_5F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_5F_LEN)-1)<<NPU_REG_ACT_TABLE_5F_POS))

/* 0x160 : BLAI_ACT_TABLE_63_60 */
#define NPU_BLAI_ACT_TABLE_63_60_OFFSET                         (0x160)
#define NPU_REG_ACT_TABLE_60                                    NPU_REG_ACT_TABLE_60
#define NPU_REG_ACT_TABLE_60_POS                                (0U)
#define NPU_REG_ACT_TABLE_60_LEN                                (8U)
#define NPU_REG_ACT_TABLE_60_MSK                                (((1U<<NPU_REG_ACT_TABLE_60_LEN)-1)<<NPU_REG_ACT_TABLE_60_POS)
#define NPU_REG_ACT_TABLE_60_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_60_LEN)-1)<<NPU_REG_ACT_TABLE_60_POS))
#define NPU_REG_ACT_TABLE_61                                    NPU_REG_ACT_TABLE_61
#define NPU_REG_ACT_TABLE_61_POS                                (8U)
#define NPU_REG_ACT_TABLE_61_LEN                                (8U)
#define NPU_REG_ACT_TABLE_61_MSK                                (((1U<<NPU_REG_ACT_TABLE_61_LEN)-1)<<NPU_REG_ACT_TABLE_61_POS)
#define NPU_REG_ACT_TABLE_61_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_61_LEN)-1)<<NPU_REG_ACT_TABLE_61_POS))
#define NPU_REG_ACT_TABLE_62                                    NPU_REG_ACT_TABLE_62
#define NPU_REG_ACT_TABLE_62_POS                                (16U)
#define NPU_REG_ACT_TABLE_62_LEN                                (8U)
#define NPU_REG_ACT_TABLE_62_MSK                                (((1U<<NPU_REG_ACT_TABLE_62_LEN)-1)<<NPU_REG_ACT_TABLE_62_POS)
#define NPU_REG_ACT_TABLE_62_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_62_LEN)-1)<<NPU_REG_ACT_TABLE_62_POS))
#define NPU_REG_ACT_TABLE_63                                    NPU_REG_ACT_TABLE_63
#define NPU_REG_ACT_TABLE_63_POS                                (24U)
#define NPU_REG_ACT_TABLE_63_LEN                                (8U)
#define NPU_REG_ACT_TABLE_63_MSK                                (((1U<<NPU_REG_ACT_TABLE_63_LEN)-1)<<NPU_REG_ACT_TABLE_63_POS)
#define NPU_REG_ACT_TABLE_63_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_63_LEN)-1)<<NPU_REG_ACT_TABLE_63_POS))

/* 0x164 : BLAI_ACT_TABLE_67_64 */
#define NPU_BLAI_ACT_TABLE_67_64_OFFSET                         (0x164)
#define NPU_REG_ACT_TABLE_64                                    NPU_REG_ACT_TABLE_64
#define NPU_REG_ACT_TABLE_64_POS                                (0U)
#define NPU_REG_ACT_TABLE_64_LEN                                (8U)
#define NPU_REG_ACT_TABLE_64_MSK                                (((1U<<NPU_REG_ACT_TABLE_64_LEN)-1)<<NPU_REG_ACT_TABLE_64_POS)
#define NPU_REG_ACT_TABLE_64_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_64_LEN)-1)<<NPU_REG_ACT_TABLE_64_POS))
#define NPU_REG_ACT_TABLE_65                                    NPU_REG_ACT_TABLE_65
#define NPU_REG_ACT_TABLE_65_POS                                (8U)
#define NPU_REG_ACT_TABLE_65_LEN                                (8U)
#define NPU_REG_ACT_TABLE_65_MSK                                (((1U<<NPU_REG_ACT_TABLE_65_LEN)-1)<<NPU_REG_ACT_TABLE_65_POS)
#define NPU_REG_ACT_TABLE_65_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_65_LEN)-1)<<NPU_REG_ACT_TABLE_65_POS))
#define NPU_REG_ACT_TABLE_66                                    NPU_REG_ACT_TABLE_66
#define NPU_REG_ACT_TABLE_66_POS                                (16U)
#define NPU_REG_ACT_TABLE_66_LEN                                (8U)
#define NPU_REG_ACT_TABLE_66_MSK                                (((1U<<NPU_REG_ACT_TABLE_66_LEN)-1)<<NPU_REG_ACT_TABLE_66_POS)
#define NPU_REG_ACT_TABLE_66_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_66_LEN)-1)<<NPU_REG_ACT_TABLE_66_POS))
#define NPU_REG_ACT_TABLE_67                                    NPU_REG_ACT_TABLE_67
#define NPU_REG_ACT_TABLE_67_POS                                (24U)
#define NPU_REG_ACT_TABLE_67_LEN                                (8U)
#define NPU_REG_ACT_TABLE_67_MSK                                (((1U<<NPU_REG_ACT_TABLE_67_LEN)-1)<<NPU_REG_ACT_TABLE_67_POS)
#define NPU_REG_ACT_TABLE_67_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_67_LEN)-1)<<NPU_REG_ACT_TABLE_67_POS))

/* 0x168 : BLAI_ACT_TABLE_6B_68 */
#define NPU_BLAI_ACT_TABLE_6B_68_OFFSET                         (0x168)
#define NPU_REG_ACT_TABLE_68                                    NPU_REG_ACT_TABLE_68
#define NPU_REG_ACT_TABLE_68_POS                                (0U)
#define NPU_REG_ACT_TABLE_68_LEN                                (8U)
#define NPU_REG_ACT_TABLE_68_MSK                                (((1U<<NPU_REG_ACT_TABLE_68_LEN)-1)<<NPU_REG_ACT_TABLE_68_POS)
#define NPU_REG_ACT_TABLE_68_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_68_LEN)-1)<<NPU_REG_ACT_TABLE_68_POS))
#define NPU_REG_ACT_TABLE_69                                    NPU_REG_ACT_TABLE_69
#define NPU_REG_ACT_TABLE_69_POS                                (8U)
#define NPU_REG_ACT_TABLE_69_LEN                                (8U)
#define NPU_REG_ACT_TABLE_69_MSK                                (((1U<<NPU_REG_ACT_TABLE_69_LEN)-1)<<NPU_REG_ACT_TABLE_69_POS)
#define NPU_REG_ACT_TABLE_69_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_69_LEN)-1)<<NPU_REG_ACT_TABLE_69_POS))
#define NPU_REG_ACT_TABLE_6A                                    NPU_REG_ACT_TABLE_6A
#define NPU_REG_ACT_TABLE_6A_POS                                (16U)
#define NPU_REG_ACT_TABLE_6A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_6A_MSK                                (((1U<<NPU_REG_ACT_TABLE_6A_LEN)-1)<<NPU_REG_ACT_TABLE_6A_POS)
#define NPU_REG_ACT_TABLE_6A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_6A_LEN)-1)<<NPU_REG_ACT_TABLE_6A_POS))
#define NPU_REG_ACT_TABLE_6B                                    NPU_REG_ACT_TABLE_6B
#define NPU_REG_ACT_TABLE_6B_POS                                (24U)
#define NPU_REG_ACT_TABLE_6B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_6B_MSK                                (((1U<<NPU_REG_ACT_TABLE_6B_LEN)-1)<<NPU_REG_ACT_TABLE_6B_POS)
#define NPU_REG_ACT_TABLE_6B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_6B_LEN)-1)<<NPU_REG_ACT_TABLE_6B_POS))

