bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x16C : BLAI_ACT_TABLE_6F_6C */
#define NPU_BLAI_ACT_TABLE_6F_6C_OFFSET                         (0x16C)
#define NPU_REG_ACT_TABLE_6C                                    NPU_REG_ACT_TABLE_6C
#define NPU_REG_ACT_TABLE_6C_POS                                (0U)
#define NPU_REG_ACT_TABLE_6C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_6C_MSK                                (((1U<<NPU_REG_ACT_TABLE_6C_LEN)-1)<<NPU_REG_ACT_TABLE_6C_POS)
#define NPU_REG_ACT_TABLE_6C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_6C_LEN)-1)<<NPU_REG_ACT_TABLE_6C_POS))
#define NPU_REG_ACT_TABLE_6D                                    NPU_REG_ACT_TABLE_6D
#define NPU_REG_ACT_TABLE_6D_POS                                (8U)
#define NPU_REG_ACT_TABLE_6D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_6D_MSK                                (((1U<<NPU_REG_ACT_TABLE_6D_LEN)-1)<<NPU_REG_ACT_TABLE_6D_POS)
#define NPU_REG_ACT_TABLE_6D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_6D_LEN)-1)<<NPU_REG_ACT_TABLE_6D_POS))
#define NPU_REG_ACT_TABLE_6E                                    NPU_REG_ACT_TABLE_6E
#define NPU_REG_ACT_TABLE_6E_POS                                (16U)
#define NPU_REG_ACT_TABLE_6E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_6E_MSK                                (((1U<<NPU_REG_ACT_TABLE_6E_LEN)-1)<<NPU_REG_ACT_TABLE_6E_POS)
#define NPU_REG_ACT_TABLE_6E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_6E_LEN)-1)<<NPU_REG_ACT_TABLE_6E_POS))
#define NPU_REG_ACT_TABLE_6F                                    NPU_REG_ACT_TABLE_6F
#define NPU_REG_ACT_TABLE_6F_POS                                (24U)
#define NPU_REG_ACT_TABLE_6F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_6F_MSK                                (((1U<<NPU_REG_ACT_TABLE_6F_LEN)-1)<<NPU_REG_ACT_TABLE_6F_POS)
#define NPU_REG_ACT_TABLE_6F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_6F_LEN)-1)<<NPU_REG_ACT_TABLE_6F_POS))

/* 0x170 : BLAI_ACT_TABLE_73_70 */
#define NPU_BLAI_ACT_TABLE_73_70_OFFSET                         (0x170)
#define NPU_REG_ACT_TABLE_70                                    NPU_REG_ACT_TABLE_70
#define NPU_REG_ACT_TABLE_70_POS                                (0U)
#define NPU_REG_ACT_TABLE_70_LEN                                (8U)
#define NPU_REG_ACT_TABLE_70_MSK                                (((1U<<NPU_REG_ACT_TABLE_70_LEN)-1)<<NPU_REG_ACT_TABLE_70_POS)
#define NPU_REG_ACT_TABLE_70_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_70_LEN)-1)<<NPU_REG_ACT_TABLE_70_POS))
#define NPU_REG_ACT_TABLE_71                                    NPU_REG_ACT_TABLE_71
#define NPU_REG_ACT_TABLE_71_POS                                (8U)
#define NPU_REG_ACT_TABLE_71_LEN                                (8U)
#define NPU_REG_ACT_TABLE_71_MSK                                (((1U<<NPU_REG_ACT_TABLE_71_LEN)-1)<<NPU_REG_ACT_TABLE_71_POS)
#define NPU_REG_ACT_TABLE_71_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_71_LEN)-1)<<NPU_REG_ACT_TABLE_71_POS))
#define NPU_REG_ACT_TABLE_72                                    NPU_REG_ACT_TABLE_72
#define NPU_REG_ACT_TABLE_72_POS                                (16U)
#define NPU_REG_ACT_TABLE_72_LEN                                (8U)
#define NPU_REG_ACT_TABLE_72_MSK                                (((1U<<NPU_REG_ACT_TABLE_72_LEN)-1)<<NPU_REG_ACT_TABLE_72_POS)
#define NPU_REG_ACT_TABLE_72_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_72_LEN)-1)<<NPU_REG_ACT_TABLE_72_POS))
#define NPU_REG_ACT_TABLE_73                                    NPU_REG_ACT_TABLE_73
#define NPU_REG_ACT_TABLE_73_POS                                (24U)
#define NPU_REG_ACT_TABLE_73_LEN                                (8U)
#define NPU_REG_ACT_TABLE_73_MSK                                (((1U<<NPU_REG_ACT_TABLE_73_LEN)-1)<<NPU_REG_ACT_TABLE_73_POS)
#define NPU_REG_ACT_TABLE_73_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_73_LEN)-1)<<NPU_REG_ACT_TABLE_73_POS))

/* 0x174 : BLAI_ACT_TABLE_77_74 */
#define NPU_BLAI_ACT_TABLE_77_74_OFFSET                         (0x174)
#define NPU_REG_ACT_TABLE_74                                    NPU_REG_ACT_TABLE_74
#define NPU_REG_ACT_TABLE_74_POS                                (0U)
#define NPU_REG_ACT_TABLE_74_LEN                                (8U)
#define NPU_REG_ACT_TABLE_74_MSK                                (((1U<<NPU_REG_ACT_TABLE_74_LEN)-1)<<NPU_REG_ACT_TABLE_74_POS)
#define NPU_REG_ACT_TABLE_74_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_74_LEN)-1)<<NPU_REG_ACT_TABLE_74_POS))
#define NPU_REG_ACT_TABLE_75                                    NPU_REG_ACT_TABLE_75
#define NPU_REG_ACT_TABLE_75_POS                                (8U)
#define NPU_REG_ACT_TABLE_75_LEN                                (8U)
#define NPU_REG_ACT_TABLE_75_MSK                                (((1U<<NPU_REG_ACT_TABLE_75_LEN)-1)<<NPU_REG_ACT_TABLE_75_POS)
#define NPU_REG_ACT_TABLE_75_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_75_LEN)-1)<<NPU_REG_ACT_TABLE_75_POS))
#define NPU_REG_ACT_TABLE_76                                    NPU_REG_ACT_TABLE_76
#define NPU_REG_ACT_TABLE_76_POS                                (16U)
#define NPU_REG_ACT_TABLE_76_LEN                                (8U)
#define NPU_REG_ACT_TABLE_76_MSK                                (((1U<<NPU_REG_ACT_TABLE_76_LEN)-1)<<NPU_REG_ACT_TABLE_76_POS)
#define NPU_REG_ACT_TABLE_76_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_76_LEN)-1)<<NPU_REG_ACT_TABLE_76_POS))
#define NPU_REG_ACT_TABLE_77                                    NPU_REG_ACT_TABLE_77
#define NPU_REG_ACT_TABLE_77_POS                                (24U)
#define NPU_REG_ACT_TABLE_77_LEN                                (8U)
#define NPU_REG_ACT_TABLE_77_MSK                                (((1U<<NPU_REG_ACT_TABLE_77_LEN)-1)<<NPU_REG_ACT_TABLE_77_POS)
#define NPU_REG_ACT_TABLE_77_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_77_LEN)-1)<<NPU_REG_ACT_TABLE_77_POS))

/* 0x178 : BLAI_ACT_TABLE_7B_78 */
#define NPU_BLAI_ACT_TABLE_7B_78_OFFSET                         (0x178)
#define NPU_REG_ACT_TABLE_78                                    NPU_REG_ACT_TABLE_78
#define NPU_REG_ACT_TABLE_78_POS                                (0U)
#define NPU_REG_ACT_TABLE_78_LEN                                (8U)
#define NPU_REG_ACT_TABLE_78_MSK                                (((1U<<NPU_REG_ACT_TABLE_78_LEN)-1)<<NPU_REG_ACT_TABLE_78_POS)
#define NPU_REG_ACT_TABLE_78_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_78_LEN)-1)<<NPU_REG_ACT_TABLE_78_POS))
#define NPU_REG_ACT_TABLE_79                                    NPU_REG_ACT_TABLE_79
#define NPU_REG_ACT_TABLE_79_POS                                (8U)
#define NPU_REG_ACT_TABLE_79_LEN                                (8U)
#define NPU_REG_ACT_TABLE_79_MSK                                (((1U<<NPU_REG_ACT_TABLE_79_LEN)-1)<<NPU_REG_ACT_TABLE_79_POS)
#define NPU_REG_ACT_TABLE_79_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_79_LEN)-1)<<NPU_REG_ACT_TABLE_79_POS))
#define NPU_REG_ACT_TABLE_7A                                    NPU_REG_ACT_TABLE_7A
#define NPU_REG_ACT_TABLE_7A_POS                                (16U)
#define NPU_REG_ACT_TABLE_7A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_7A_MSK                                (((1U<<NPU_REG_ACT_TABLE_7A_LEN)-1)<<NPU_REG_ACT_TABLE_7A_POS)
#define NPU_REG_ACT_TABLE_7A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_7A_LEN)-1)<<NPU_REG_ACT_TABLE_7A_POS))
#define NPU_REG_ACT_TABLE_7B                                    NPU_REG_ACT_TABLE_7B
#define NPU_REG_ACT_TABLE_7B_POS                                (24U)
#define NPU_REG_ACT_TABLE_7B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_7B_MSK                                (((1U<<NPU_REG_ACT_TABLE_7B_LEN)-1)<<NPU_REG_ACT_TABLE_7B_POS)
#define NPU_REG_ACT_TABLE_7B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_7B_LEN)-1)<<NPU_REG_ACT_TABLE_7B_POS))

/* 0x17C : BLAI_ACT_TABLE_7F_7C */
#define NPU_BLAI_ACT_TABLE_7F_7C_OFFSET                         (0x17C)
#define NPU_REG_ACT_TABLE_7C                                    NPU_REG_ACT_TABLE_7C
#define NPU_REG_ACT_TABLE_7C_POS                                (0U)
#define NPU_REG_ACT_TABLE_7C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_7C_MSK                                (((1U<<NPU_REG_ACT_TABLE_7C_LEN)-1)<<NPU_REG_ACT_TABLE_7C_POS)
#define NPU_REG_ACT_TABLE_7C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_7C_LEN)-1)<<NPU_REG_ACT_TABLE_7C_POS))
#define NPU_REG_ACT_TABLE_7D                                    NPU_REG_ACT_TABLE_7D
#define NPU_REG_ACT_TABLE_7D_POS                                (8U)
#define NPU_REG_ACT_TABLE_7D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_7D_MSK                                (((1U<<NPU_REG_ACT_TABLE_7D_LEN)-1)<<NPU_REG_ACT_TABLE_7D_POS)
#define NPU_REG_ACT_TABLE_7D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_7D_LEN)-1)<<NPU_REG_ACT_TABLE_7D_POS))
#define NPU_REG_ACT_TABLE_7E                                    NPU_REG_ACT_TABLE_7E
#define NPU_REG_ACT_TABLE_7E_POS                                (16U)
#define NPU_REG_ACT_TABLE_7E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_7E_MSK                                (((1U<<NPU_REG_ACT_TABLE_7E_LEN)-1)<<NPU_REG_ACT_TABLE_7E_POS)
#define NPU_REG_ACT_TABLE_7E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_7E_LEN)-1)<<NPU_REG_ACT_TABLE_7E_POS))
#define NPU_REG_ACT_TABLE_7F                                    NPU_REG_ACT_TABLE_7F
#define NPU_REG_ACT_TABLE_7F_POS                                (24U)
#define NPU_REG_ACT_TABLE_7F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_7F_MSK                                (((1U<<NPU_REG_ACT_TABLE_7F_LEN)-1)<<NPU_REG_ACT_TABLE_7F_POS)
#define NPU_REG_ACT_TABLE_7F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_7F_LEN)-1)<<NPU_REG_ACT_TABLE_7F_POS))

/* 0x180 : BLAI_ACT_TABLE_83_80 */
#define NPU_BLAI_ACT_TABLE_83_80_OFFSET                         (0x180)
#define NPU_REG_ACT_TABLE_80                                    NPU_REG_ACT_TABLE_80
#define NPU_REG_ACT_TABLE_80_POS                                (0U)
#define NPU_REG_ACT_TABLE_80_LEN                                (8U)
#define NPU_REG_ACT_TABLE_80_MSK                                (((1U<<NPU_REG_ACT_TABLE_80_LEN)-1)<<NPU_REG_ACT_TABLE_80_POS)
#define NPU_REG_ACT_TABLE_80_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_80_LEN)-1)<<NPU_REG_ACT_TABLE_80_POS))
#define NPU_REG_ACT_TABLE_81                                    NPU_REG_ACT_TABLE_81
#define NPU_REG_ACT_TABLE_81_POS                                (8U)
#define NPU_REG_ACT_TABLE_81_LEN                                (8U)
#define NPU_REG_ACT_TABLE_81_MSK                                (((1U<<NPU_REG_ACT_TABLE_81_LEN)-1)<<NPU_REG_ACT_TABLE_81_POS)
#define NPU_REG_ACT_TABLE_81_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_81_LEN)-1)<<NPU_REG_ACT_TABLE_81_POS))
#define NPU_REG_ACT_TABLE_82                                    NPU_REG_ACT_TABLE_82
#define NPU_REG_ACT_TABLE_82_POS                                (16U)
#define NPU_REG_ACT_TABLE_82_LEN                                (8U)
#define NPU_REG_ACT_TABLE_82_MSK                                (((1U<<NPU_REG_ACT_TABLE_82_LEN)-1)<<NPU_REG_ACT_TABLE_82_POS)
#define NPU_REG_ACT_TABLE_82_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_82_LEN)-1)<<NPU_REG_ACT_TABLE_82_POS))
#define NPU_REG_ACT_TABLE_83                                    NPU_REG_ACT_TABLE_83
#define NPU_REG_ACT_TABLE_83_POS                                (24U)
#define NPU_REG_ACT_TABLE_83_LEN                                (8U)
#define NPU_REG_ACT_TABLE_83_MSK                                (((1U<<NPU_REG_ACT_TABLE_83_LEN)-1)<<NPU_REG_ACT_TABLE_83_POS)
#define NPU_REG_ACT_TABLE_83_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_83_LEN)-1)<<NPU_REG_ACT_TABLE_83_POS))

/* 0x184 : BLAI_ACT_TABLE_87_84 */
#define NPU_BLAI_ACT_TABLE_87_84_OFFSET                         (0x184)
#define NPU_REG_ACT_TABLE_84                                    NPU_REG_ACT_TABLE_84
#define NPU_REG_ACT_TABLE_84_POS                                (0U)
#define NPU_REG_ACT_TABLE_84_LEN                                (8U)
#define NPU_REG_ACT_TABLE_84_MSK                                (((1U<<NPU_REG_ACT_TABLE_84_LEN)-1)<<NPU_REG_ACT_TABLE_84_POS)
#define NPU_REG_ACT_TABLE_84_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_84_LEN)-1)<<NPU_REG_ACT_TABLE_84_POS))
#define NPU_REG_ACT_TABLE_85                                    NPU_REG_ACT_TABLE_85
#define NPU_REG_ACT_TABLE_85_POS                                (8U)
#define NPU_REG_ACT_TABLE_85_LEN                                (8U)
#define NPU_REG_ACT_TABLE_85_MSK                                (((1U<<NPU_REG_ACT_TABLE_85_LEN)-1)<<NPU_REG_ACT_TABLE_85_POS)
#define NPU_REG_ACT_TABLE_85_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_85_LEN)-1)<<NPU_REG_ACT_TABLE_85_POS))
#define NPU_REG_ACT_TABLE_86                                    NPU_REG_ACT_TABLE_86
#define NPU_REG_ACT_TABLE_86_POS                                (16U)
#define NPU_REG_ACT_TABLE_86_LEN                                (8U)
#define NPU_REG_ACT_TABLE_86_MSK                                (((1U<<NPU_REG_ACT_TABLE_86_LEN)-1)<<NPU_REG_ACT_TABLE_86_POS)
#define NPU_REG_ACT_TABLE_86_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_86_LEN)-1)<<NPU_REG_ACT_TABLE_86_POS))
#define NPU_REG_ACT_TABLE_87                                    NPU_REG_ACT_TABLE_87
#define NPU_REG_ACT_TABLE_87_POS                                (24U)
#define NPU_REG_ACT_TABLE_87_LEN                                (8U)
#define NPU_REG_ACT_TABLE_87_MSK                                (((1U<<NPU_REG_ACT_TABLE_87_LEN)-1)<<NPU_REG_ACT_TABLE_87_POS)
#define NPU_REG_ACT_TABLE_87_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_87_LEN)-1)<<NPU_REG_ACT_TABLE_87_POS))

