bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x188 : BLAI_ACT_TABLE_8B_88 */
#define NPU_BLAI_ACT_TABLE_8B_88_OFFSET                         (0x188)
#define NPU_REG_ACT_TABLE_88                                    NPU_REG_ACT_TABLE_88
#define NPU_REG_ACT_TABLE_88_POS                                (0U)
#define NPU_REG_ACT_TABLE_88_LEN                                (8U)
#define NPU_REG_ACT_TABLE_88_MSK                                (((1U<<NPU_REG_ACT_TABLE_88_LEN)-1)<<NPU_REG_ACT_TABLE_88_POS)
#define NPU_REG_ACT_TABLE_88_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_88_LEN)-1)<<NPU_REG_ACT_TABLE_88_POS))
#define NPU_REG_ACT_TABLE_89                                    NPU_REG_ACT_TABLE_89
#define NPU_REG_ACT_TABLE_89_POS                                (8U)
#define NPU_REG_ACT_TABLE_89_LEN                                (8U)
#define NPU_REG_ACT_TABLE_89_MSK                                (((1U<<NPU_REG_ACT_TABLE_89_LEN)-1)<<NPU_REG_ACT_TABLE_89_POS)
#define NPU_REG_ACT_TABLE_89_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_89_LEN)-1)<<NPU_REG_ACT_TABLE_89_POS))
#define NPU_REG_ACT_TABLE_8A                                    NPU_REG_ACT_TABLE_8A
#define NPU_REG_ACT_TABLE_8A_POS                                (16U)
#define NPU_REG_ACT_TABLE_8A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_8A_MSK                                (((1U<<NPU_REG_ACT_TABLE_8A_LEN)-1)<<NPU_REG_ACT_TABLE_8A_POS)
#define NPU_REG_ACT_TABLE_8A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_8A_LEN)-1)<<NPU_REG_ACT_TABLE_8A_POS))
#define NPU_REG_ACT_TABLE_8B                                    NPU_REG_ACT_TABLE_8B
#define NPU_REG_ACT_TABLE_8B_POS                                (24U)
#define NPU_REG_ACT_TABLE_8B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_8B_MSK                                (((1U<<NPU_REG_ACT_TABLE_8B_LEN)-1)<<NPU_REG_ACT_TABLE_8B_POS)
#define NPU_REG_ACT_TABLE_8B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_8B_LEN)-1)<<NPU_REG_ACT_TABLE_8B_POS))

/* 0x18C : BLAI_ACT_TABLE_8F_8C */
#define NPU_BLAI_ACT_TABLE_8F_8C_OFFSET                         (0x18C)
#define NPU_REG_ACT_TABLE_8C                                    NPU_REG_ACT_TABLE_8C
#define NPU_REG_ACT_TABLE_8C_POS                                (0U)
#define NPU_REG_ACT_TABLE_8C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_8C_MSK                                (((1U<<NPU_REG_ACT_TABLE_8C_LEN)-1)<<NPU_REG_ACT_TABLE_8C_POS)
#define NPU_REG_ACT_TABLE_8C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_8C_LEN)-1)<<NPU_REG_ACT_TABLE_8C_POS))
#define NPU_REG_ACT_TABLE_8D                                    NPU_REG_ACT_TABLE_8D
#define NPU_REG_ACT_TABLE_8D_POS                                (8U)
#define NPU_REG_ACT_TABLE_8D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_8D_MSK                                (((1U<<NPU_REG_ACT_TABLE_8D_LEN)-1)<<NPU_REG_ACT_TABLE_8D_POS)
#define NPU_REG_ACT_TABLE_8D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_8D_LEN)-1)<<NPU_REG_ACT_TABLE_8D_POS))
#define NPU_REG_ACT_TABLE_8E                                    NPU_REG_ACT_TABLE_8E
#define NPU_REG_ACT_TABLE_8E_POS                                (16U)
#define NPU_REG_ACT_TABLE_8E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_8E_MSK                                (((1U<<NPU_REG_ACT_TABLE_8E_LEN)-1)<<NPU_REG_ACT_TABLE_8E_POS)
#define NPU_REG_ACT_TABLE_8E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_8E_LEN)-1)<<NPU_REG_ACT_TABLE_8E_POS))
#define NPU_REG_ACT_TABLE_8F                                    NPU_REG_ACT_TABLE_8F
#define NPU_REG_ACT_TABLE_8F_POS                                (24U)
#define NPU_REG_ACT_TABLE_8F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_8F_MSK                                (((1U<<NPU_REG_ACT_TABLE_8F_LEN)-1)<<NPU_REG_ACT_TABLE_8F_POS)
#define NPU_REG_ACT_TABLE_8F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_8F_LEN)-1)<<NPU_REG_ACT_TABLE_8F_POS))

/* 0x190 : BLAI_ACT_TABLE_93_90 */
#define NPU_BLAI_ACT_TABLE_93_90_OFFSET                         (0x190)
#define NPU_REG_ACT_TABLE_90                                    NPU_REG_ACT_TABLE_90
#define NPU_REG_ACT_TABLE_90_POS                                (0U)
#define NPU_REG_ACT_TABLE_90_LEN                                (8U)
#define NPU_REG_ACT_TABLE_90_MSK                                (((1U<<NPU_REG_ACT_TABLE_90_LEN)-1)<<NPU_REG_ACT_TABLE_90_POS)
#define NPU_REG_ACT_TABLE_90_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_90_LEN)-1)<<NPU_REG_ACT_TABLE_90_POS))
#define NPU_REG_ACT_TABLE_91                                    NPU_REG_ACT_TABLE_91
#define NPU_REG_ACT_TABLE_91_POS                                (8U)
#define NPU_REG_ACT_TABLE_91_LEN                                (8U)
#define NPU_REG_ACT_TABLE_91_MSK                                (((1U<<NPU_REG_ACT_TABLE_91_LEN)-1)<<NPU_REG_ACT_TABLE_91_POS)
#define NPU_REG_ACT_TABLE_91_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_91_LEN)-1)<<NPU_REG_ACT_TABLE_91_POS))
#define NPU_REG_ACT_TABLE_92                                    NPU_REG_ACT_TABLE_92
#define NPU_REG_ACT_TABLE_92_POS                                (16U)
#define NPU_REG_ACT_TABLE_92_LEN                                (8U)
#define NPU_REG_ACT_TABLE_92_MSK                                (((1U<<NPU_REG_ACT_TABLE_92_LEN)-1)<<NPU_REG_ACT_TABLE_92_POS)
#define NPU_REG_ACT_TABLE_92_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_92_LEN)-1)<<NPU_REG_ACT_TABLE_92_POS))
#define NPU_REG_ACT_TABLE_93                                    NPU_REG_ACT_TABLE_93
#define NPU_REG_ACT_TABLE_93_POS                                (24U)
#define NPU_REG_ACT_TABLE_93_LEN                                (8U)
#define NPU_REG_ACT_TABLE_93_MSK                                (((1U<<NPU_REG_ACT_TABLE_93_LEN)-1)<<NPU_REG_ACT_TABLE_93_POS)
#define NPU_REG_ACT_TABLE_93_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_93_LEN)-1)<<NPU_REG_ACT_TABLE_93_POS))

