bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x194 : BLAI_ACT_TABLE_97_94 */
#define NPU_BLAI_ACT_TABLE_97_94_OFFSET                         (0x194)
#define NPU_REG_ACT_TABLE_94                                    NPU_REG_ACT_TABLE_94
#define NPU_REG_ACT_TABLE_94_POS                                (0U)
#define NPU_REG_ACT_TABLE_94_LEN                                (8U)
#define NPU_REG_ACT_TABLE_94_MSK                                (((1U<<NPU_REG_ACT_TABLE_94_LEN)-1)<<NPU_REG_ACT_TABLE_94_POS)
#define NPU_REG_ACT_TABLE_94_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_94_LEN)-1)<<NPU_REG_ACT_TABLE_94_POS))
#define NPU_REG_ACT_TABLE_95                                    NPU_REG_ACT_TABLE_95
#define NPU_REG_ACT_TABLE_95_POS                                (8U)
#define NPU_REG_ACT_TABLE_95_LEN                                (8U)
#define NPU_REG_ACT_TABLE_95_MSK                                (((1U<<NPU_REG_ACT_TABLE_95_LEN)-1)<<NPU_REG_ACT_TABLE_95_POS)
#define NPU_REG_ACT_TABLE_95_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_95_LEN)-1)<<NPU_REG_ACT_TABLE_95_POS))
#define NPU_REG_ACT_TABLE_96                                    NPU_REG_ACT_TABLE_96
#define NPU_REG_ACT_TABLE_96_POS                                (16U)
#define NPU_REG_ACT_TABLE_96_LEN                                (8U)
#define NPU_REG_ACT_TABLE_96_MSK                                (((1U<<NPU_REG_ACT_TABLE_96_LEN)-1)<<NPU_REG_ACT_TABLE_96_POS)
#define NPU_REG_ACT_TABLE_96_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_96_LEN)-1)<<NPU_REG_ACT_TABLE_96_POS))
#define NPU_REG_ACT_TABLE_97                                    NPU_REG_ACT_TABLE_97
#define NPU_REG_ACT_TABLE_97_POS                                (24U)
#define NPU_REG_ACT_TABLE_97_LEN                                (8U)
#define NPU_REG_ACT_TABLE_97_MSK                                (((1U<<NPU_REG_ACT_TABLE_97_LEN)-1)<<NPU_REG_ACT_TABLE_97_POS)
#define NPU_REG_ACT_TABLE_97_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_97_LEN)-1)<<NPU_REG_ACT_TABLE_97_POS))

/* 0x198 : BLAI_ACT_TABLE_9B_98 */
#define NPU_BLAI_ACT_TABLE_9B_98_OFFSET                         (0x198)
#define NPU_REG_ACT_TABLE_98                                    NPU_REG_ACT_TABLE_98
#define NPU_REG_ACT_TABLE_98_POS                                (0U)
#define NPU_REG_ACT_TABLE_98_LEN                                (8U)
#define NPU_REG_ACT_TABLE_98_MSK                                (((1U<<NPU_REG_ACT_TABLE_98_LEN)-1)<<NPU_REG_ACT_TABLE_98_POS)
#define NPU_REG_ACT_TABLE_98_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_98_LEN)-1)<<NPU_REG_ACT_TABLE_98_POS))
#define NPU_REG_ACT_TABLE_99                                    NPU_REG_ACT_TABLE_99
#define NPU_REG_ACT_TABLE_99_POS                                (8U)
#define NPU_REG_ACT_TABLE_99_LEN                                (8U)
#define NPU_REG_ACT_TABLE_99_MSK                                (((1U<<NPU_REG_ACT_TABLE_99_LEN)-1)<<NPU_REG_ACT_TABLE_99_POS)
#define NPU_REG_ACT_TABLE_99_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_99_LEN)-1)<<NPU_REG_ACT_TABLE_99_POS))
#define NPU_REG_ACT_TABLE_9A                                    NPU_REG_ACT_TABLE_9A
#define NPU_REG_ACT_TABLE_9A_POS                                (16U)
#define NPU_REG_ACT_TABLE_9A_LEN                                (8U)
#define NPU_REG_ACT_TABLE_9A_MSK                                (((1U<<NPU_REG_ACT_TABLE_9A_LEN)-1)<<NPU_REG_ACT_TABLE_9A_POS)
#define NPU_REG_ACT_TABLE_9A_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_9A_LEN)-1)<<NPU_REG_ACT_TABLE_9A_POS))
#define NPU_REG_ACT_TABLE_9B                                    NPU_REG_ACT_TABLE_9B
#define NPU_REG_ACT_TABLE_9B_POS                                (24U)
#define NPU_REG_ACT_TABLE_9B_LEN                                (8U)
#define NPU_REG_ACT_TABLE_9B_MSK                                (((1U<<NPU_REG_ACT_TABLE_9B_LEN)-1)<<NPU_REG_ACT_TABLE_9B_POS)
#define NPU_REG_ACT_TABLE_9B_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_9B_LEN)-1)<<NPU_REG_ACT_TABLE_9B_POS))

/* 0x19C : BLAI_ACT_TABLE_9F_9C */
#define NPU_BLAI_ACT_TABLE_9F_9C_OFFSET                         (0x19C)
#define NPU_REG_ACT_TABLE_9C                                    NPU_REG_ACT_TABLE_9C
#define NPU_REG_ACT_TABLE_9C_POS                                (0U)
#define NPU_REG_ACT_TABLE_9C_LEN                                (8U)
#define NPU_REG_ACT_TABLE_9C_MSK                                (((1U<<NPU_REG_ACT_TABLE_9C_LEN)-1)<<NPU_REG_ACT_TABLE_9C_POS)
#define NPU_REG_ACT_TABLE_9C_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_9C_LEN)-1)<<NPU_REG_ACT_TABLE_9C_POS))
#define NPU_REG_ACT_TABLE_9D                                    NPU_REG_ACT_TABLE_9D
#define NPU_REG_ACT_TABLE_9D_POS                                (8U)
#define NPU_REG_ACT_TABLE_9D_LEN                                (8U)
#define NPU_REG_ACT_TABLE_9D_MSK                                (((1U<<NPU_REG_ACT_TABLE_9D_LEN)-1)<<NPU_REG_ACT_TABLE_9D_POS)
#define NPU_REG_ACT_TABLE_9D_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_9D_LEN)-1)<<NPU_REG_ACT_TABLE_9D_POS))
#define NPU_REG_ACT_TABLE_9E                                    NPU_REG_ACT_TABLE_9E
#define NPU_REG_ACT_TABLE_9E_POS                                (16U)
#define NPU_REG_ACT_TABLE_9E_LEN                                (8U)
#define NPU_REG_ACT_TABLE_9E_MSK                                (((1U<<NPU_REG_ACT_TABLE_9E_LEN)-1)<<NPU_REG_ACT_TABLE_9E_POS)
#define NPU_REG_ACT_TABLE_9E_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_9E_LEN)-1)<<NPU_REG_ACT_TABLE_9E_POS))
#define NPU_REG_ACT_TABLE_9F                                    NPU_REG_ACT_TABLE_9F
#define NPU_REG_ACT_TABLE_9F_POS                                (24U)
#define NPU_REG_ACT_TABLE_9F_LEN                                (8U)
#define NPU_REG_ACT_TABLE_9F_MSK                                (((1U<<NPU_REG_ACT_TABLE_9F_LEN)-1)<<NPU_REG_ACT_TABLE_9F_POS)
#define NPU_REG_ACT_TABLE_9F_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_9F_LEN)-1)<<NPU_REG_ACT_TABLE_9F_POS))

