bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x1A0 : BLAI_ACT_TABLE_a3_a0 */
#define NPU_BLAI_ACT_TABLE_A3_A0_OFFSET                         (0x1A0)
#define NPU_REG_ACT_TABLE_A0                                    NPU_REG_ACT_TABLE_A0
#define NPU_REG_ACT_TABLE_A0_POS                                (0U)
#define NPU_REG_ACT_TABLE_A0_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A0_MSK                                (((1U<<NPU_REG_ACT_TABLE_A0_LEN)-1)<<NPU_REG_ACT_TABLE_A0_POS)
#define NPU_REG_ACT_TABLE_A0_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A0_LEN)-1)<<NPU_REG_ACT_TABLE_A0_POS))
#define NPU_REG_ACT_TABLE_A1                                    NPU_REG_ACT_TABLE_A1
#define NPU_REG_ACT_TABLE_A1_POS                                (8U)
#define NPU_REG_ACT_TABLE_A1_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A1_MSK                                (((1U<<NPU_REG_ACT_TABLE_A1_LEN)-1)<<NPU_REG_ACT_TABLE_A1_POS)
#define NPU_REG_ACT_TABLE_A1_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A1_LEN)-1)<<NPU_REG_ACT_TABLE_A1_POS))
#define NPU_REG_ACT_TABLE_A2                                    NPU_REG_ACT_TABLE_A2
#define NPU_REG_ACT_TABLE_A2_POS                                (16U)
#define NPU_REG_ACT_TABLE_A2_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A2_MSK                                (((1U<<NPU_REG_ACT_TABLE_A2_LEN)-1)<<NPU_REG_ACT_TABLE_A2_POS)
#define NPU_REG_ACT_TABLE_A2_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A2_LEN)-1)<<NPU_REG_ACT_TABLE_A2_POS))
#define NPU_REG_ACT_TABLE_A3                                    NPU_REG_ACT_TABLE_A3
#define NPU_REG_ACT_TABLE_A3_POS                                (24U)
#define NPU_REG_ACT_TABLE_A3_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A3_MSK                                (((1U<<NPU_REG_ACT_TABLE_A3_LEN)-1)<<NPU_REG_ACT_TABLE_A3_POS)
#define NPU_REG_ACT_TABLE_A3_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A3_LEN)-1)<<NPU_REG_ACT_TABLE_A3_POS))

/* 0x1A4 : BLAI_ACT_TABLE_a7_a4 */
#define NPU_BLAI_ACT_TABLE_A7_A4_OFFSET                         (0x1A4)
#define NPU_REG_ACT_TABLE_A4                                    NPU_REG_ACT_TABLE_A4
#define NPU_REG_ACT_TABLE_A4_POS                                (0U)
#define NPU_REG_ACT_TABLE_A4_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A4_MSK                                (((1U<<NPU_REG_ACT_TABLE_A4_LEN)-1)<<NPU_REG_ACT_TABLE_A4_POS)
#define NPU_REG_ACT_TABLE_A4_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A4_LEN)-1)<<NPU_REG_ACT_TABLE_A4_POS))
#define NPU_REG_ACT_TABLE_A5                                    NPU_REG_ACT_TABLE_A5
#define NPU_REG_ACT_TABLE_A5_POS                                (8U)
#define NPU_REG_ACT_TABLE_A5_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A5_MSK                                (((1U<<NPU_REG_ACT_TABLE_A5_LEN)-1)<<NPU_REG_ACT_TABLE_A5_POS)
#define NPU_REG_ACT_TABLE_A5_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A5_LEN)-1)<<NPU_REG_ACT_TABLE_A5_POS))
#define NPU_REG_ACT_TABLE_A6                                    NPU_REG_ACT_TABLE_A6
#define NPU_REG_ACT_TABLE_A6_POS                                (16U)
#define NPU_REG_ACT_TABLE_A6_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A6_MSK                                (((1U<<NPU_REG_ACT_TABLE_A6_LEN)-1)<<NPU_REG_ACT_TABLE_A6_POS)
#define NPU_REG_ACT_TABLE_A6_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A6_LEN)-1)<<NPU_REG_ACT_TABLE_A6_POS))
#define NPU_REG_ACT_TABLE_A7                                    NPU_REG_ACT_TABLE_A7
#define NPU_REG_ACT_TABLE_A7_POS                                (24U)
#define NPU_REG_ACT_TABLE_A7_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A7_MSK                                (((1U<<NPU_REG_ACT_TABLE_A7_LEN)-1)<<NPU_REG_ACT_TABLE_A7_POS)
#define NPU_REG_ACT_TABLE_A7_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A7_LEN)-1)<<NPU_REG_ACT_TABLE_A7_POS))

/* 0x1A8 : BLAI_ACT_TABLE_aB_a8 */
#define NPU_BLAI_ACT_TABLE_AB_A8_OFFSET                         (0x1A8)
#define NPU_REG_ACT_TABLE_A8                                    NPU_REG_ACT_TABLE_A8
#define NPU_REG_ACT_TABLE_A8_POS                                (0U)
#define NPU_REG_ACT_TABLE_A8_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A8_MSK                                (((1U<<NPU_REG_ACT_TABLE_A8_LEN)-1)<<NPU_REG_ACT_TABLE_A8_POS)
#define NPU_REG_ACT_TABLE_A8_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A8_LEN)-1)<<NPU_REG_ACT_TABLE_A8_POS))
#define NPU_REG_ACT_TABLE_A9                                    NPU_REG_ACT_TABLE_A9
#define NPU_REG_ACT_TABLE_A9_POS                                (8U)
#define NPU_REG_ACT_TABLE_A9_LEN                                (8U)
#define NPU_REG_ACT_TABLE_A9_MSK                                (((1U<<NPU_REG_ACT_TABLE_A9_LEN)-1)<<NPU_REG_ACT_TABLE_A9_POS)
#define NPU_REG_ACT_TABLE_A9_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_A9_LEN)-1)<<NPU_REG_ACT_TABLE_A9_POS))
#define NPU_REG_ACT_TABLE_AA                                    NPU_REG_ACT_TABLE_AA
#define NPU_REG_ACT_TABLE_AA_POS                                (16U)
#define NPU_REG_ACT_TABLE_AA_LEN                                (8U)
#define NPU_REG_ACT_TABLE_AA_MSK                                (((1U<<NPU_REG_ACT_TABLE_AA_LEN)-1)<<NPU_REG_ACT_TABLE_AA_POS)
#define NPU_REG_ACT_TABLE_AA_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_AA_LEN)-1)<<NPU_REG_ACT_TABLE_AA_POS))
#define NPU_REG_ACT_TABLE_AB                                    NPU_REG_ACT_TABLE_AB
#define NPU_REG_ACT_TABLE_AB_POS                                (24U)
#define NPU_REG_ACT_TABLE_AB_LEN                                (8U)
#define NPU_REG_ACT_TABLE_AB_MSK                                (((1U<<NPU_REG_ACT_TABLE_AB_LEN)-1)<<NPU_REG_ACT_TABLE_AB_POS)
#define NPU_REG_ACT_TABLE_AB_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_AB_LEN)-1)<<NPU_REG_ACT_TABLE_AB_POS))

/* 0x1AC : BLAI_ACT_TABLE_aF_aC */
#define NPU_BLAI_ACT_TABLE_AF_AC_OFFSET                         (0x1AC)
#define NPU_REG_ACT_TABLE_AC                                    NPU_REG_ACT_TABLE_AC
#define NPU_REG_ACT_TABLE_AC_POS                                (0U)
#define NPU_REG_ACT_TABLE_AC_LEN                                (8U)
#define NPU_REG_ACT_TABLE_AC_MSK                                (((1U<<NPU_REG_ACT_TABLE_AC_LEN)-1)<<NPU_REG_ACT_TABLE_AC_POS)
#define NPU_REG_ACT_TABLE_AC_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_AC_LEN)-1)<<NPU_REG_ACT_TABLE_AC_POS))
#define NPU_REG_ACT_TABLE_AD                                    NPU_REG_ACT_TABLE_AD
#define NPU_REG_ACT_TABLE_AD_POS                                (8U)
#define NPU_REG_ACT_TABLE_AD_LEN                                (8U)
#define NPU_REG_ACT_TABLE_AD_MSK                                (((1U<<NPU_REG_ACT_TABLE_AD_LEN)-1)<<NPU_REG_ACT_TABLE_AD_POS)
#define NPU_REG_ACT_TABLE_AD_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_AD_LEN)-1)<<NPU_REG_ACT_TABLE_AD_POS))
#define NPU_REG_ACT_TABLE_AE                                    NPU_REG_ACT_TABLE_AE
#define NPU_REG_ACT_TABLE_AE_POS                                (16U)
#define NPU_REG_ACT_TABLE_AE_LEN                                (8U)
#define NPU_REG_ACT_TABLE_AE_MSK                                (((1U<<NPU_REG_ACT_TABLE_AE_LEN)-1)<<NPU_REG_ACT_TABLE_AE_POS)
#define NPU_REG_ACT_TABLE_AE_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_AE_LEN)-1)<<NPU_REG_ACT_TABLE_AE_POS))
#define NPU_REG_ACT_TABLE_AF                                    NPU_REG_ACT_TABLE_AF
#define NPU_REG_ACT_TABLE_AF_POS                                (24U)
#define NPU_REG_ACT_TABLE_AF_LEN                                (8U)
#define NPU_REG_ACT_TABLE_AF_MSK                                (((1U<<NPU_REG_ACT_TABLE_AF_LEN)-1)<<NPU_REG_ACT_TABLE_AF_POS)
#define NPU_REG_ACT_TABLE_AF_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_AF_LEN)-1)<<NPU_REG_ACT_TABLE_AF_POS))

