bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x1B0 : BLAI_ACT_TABLE_b3_b0 */
#define NPU_BLAI_ACT_TABLE_B3_B0_OFFSET                         (0x1B0)
#define NPU_REG_ACT_TABLE_B0                                    NPU_REG_ACT_TABLE_B0
#define NPU_REG_ACT_TABLE_B0_POS                                (0U)
#define NPU_REG_ACT_TABLE_B0_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B0_MSK                                (((1U<<NPU_REG_ACT_TABLE_B0_LEN)-1)<<NPU_REG_ACT_TABLE_B0_POS)
#define NPU_REG_ACT_TABLE_B0_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B0_LEN)-1)<<NPU_REG_ACT_TABLE_B0_POS))
#define NPU_REG_ACT_TABLE_B1                                    NPU_REG_ACT_TABLE_B1
#define NPU_REG_ACT_TABLE_B1_POS                                (8U)
#define NPU_REG_ACT_TABLE_B1_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B1_MSK                                (((1U<<NPU_REG_ACT_TABLE_B1_LEN)-1)<<NPU_REG_ACT_TABLE_B1_POS)
#define NPU_REG_ACT_TABLE_B1_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B1_LEN)-1)<<NPU_REG_ACT_TABLE_B1_POS))
#define NPU_REG_ACT_TABLE_B2                                    NPU_REG_ACT_TABLE_B2
#define NPU_REG_ACT_TABLE_B2_POS                                (16U)
#define NPU_REG_ACT_TABLE_B2_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B2_MSK                                (((1U<<NPU_REG_ACT_TABLE_B2_LEN)-1)<<NPU_REG_ACT_TABLE_B2_POS)
#define NPU_REG_ACT_TABLE_B2_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B2_LEN)-1)<<NPU_REG_ACT_TABLE_B2_POS))
#define NPU_REG_ACT_TABLE_B3                                    NPU_REG_ACT_TABLE_B3
#define NPU_REG_ACT_TABLE_B3_POS                                (24U)
#define NPU_REG_ACT_TABLE_B3_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B3_MSK                                (((1U<<NPU_REG_ACT_TABLE_B3_LEN)-1)<<NPU_REG_ACT_TABLE_B3_POS)
#define NPU_REG_ACT_TABLE_B3_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B3_LEN)-1)<<NPU_REG_ACT_TABLE_B3_POS))

/* 0x1B4 : BLAI_ACT_TABLE_b7_b4 */
#define NPU_BLAI_ACT_TABLE_B7_B4_OFFSET                         (0x1B4)
#define NPU_REG_ACT_TABLE_B4                                    NPU_REG_ACT_TABLE_B4
#define NPU_REG_ACT_TABLE_B4_POS                                (0U)
#define NPU_REG_ACT_TABLE_B4_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B4_MSK                                (((1U<<NPU_REG_ACT_TABLE_B4_LEN)-1)<<NPU_REG_ACT_TABLE_B4_POS)
#define NPU_REG_ACT_TABLE_B4_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B4_LEN)-1)<<NPU_REG_ACT_TABLE_B4_POS))
#define NPU_REG_ACT_TABLE_B5                                    NPU_REG_ACT_TABLE_B5
#define NPU_REG_ACT_TABLE_B5_POS                                (8U)
#define NPU_REG_ACT_TABLE_B5_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B5_MSK                                (((1U<<NPU_REG_ACT_TABLE_B5_LEN)-1)<<NPU_REG_ACT_TABLE_B5_POS)
#define NPU_REG_ACT_TABLE_B5_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B5_LEN)-1)<<NPU_REG_ACT_TABLE_B5_POS))
#define NPU_REG_ACT_TABLE_B6                                    NPU_REG_ACT_TABLE_B6
#define NPU_REG_ACT_TABLE_B6_POS                                (16U)
#define NPU_REG_ACT_TABLE_B6_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B6_MSK                                (((1U<<NPU_REG_ACT_TABLE_B6_LEN)-1)<<NPU_REG_ACT_TABLE_B6_POS)
#define NPU_REG_ACT_TABLE_B6_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B6_LEN)-1)<<NPU_REG_ACT_TABLE_B6_POS))
#define NPU_REG_ACT_TABLE_B7                                    NPU_REG_ACT_TABLE_B7
#define NPU_REG_ACT_TABLE_B7_POS                                (24U)
#define NPU_REG_ACT_TABLE_B7_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B7_MSK                                (((1U<<NPU_REG_ACT_TABLE_B7_LEN)-1)<<NPU_REG_ACT_TABLE_B7_POS)
#define NPU_REG_ACT_TABLE_B7_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B7_LEN)-1)<<NPU_REG_ACT_TABLE_B7_POS))

/* 0x1B8 : BLAI_ACT_TABLE_bB_b8 */
#define NPU_BLAI_ACT_TABLE_BB_B8_OFFSET                         (0x1B8)
#define NPU_REG_ACT_TABLE_B8                                    NPU_REG_ACT_TABLE_B8
#define NPU_REG_ACT_TABLE_B8_POS                                (0U)
#define NPU_REG_ACT_TABLE_B8_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B8_MSK                                (((1U<<NPU_REG_ACT_TABLE_B8_LEN)-1)<<NPU_REG_ACT_TABLE_B8_POS)
#define NPU_REG_ACT_TABLE_B8_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B8_LEN)-1)<<NPU_REG_ACT_TABLE_B8_POS))
#define NPU_REG_ACT_TABLE_B9                                    NPU_REG_ACT_TABLE_B9
#define NPU_REG_ACT_TABLE_B9_POS                                (8U)
#define NPU_REG_ACT_TABLE_B9_LEN                                (8U)
#define NPU_REG_ACT_TABLE_B9_MSK                                (((1U<<NPU_REG_ACT_TABLE_B9_LEN)-1)<<NPU_REG_ACT_TABLE_B9_POS)
#define NPU_REG_ACT_TABLE_B9_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_B9_LEN)-1)<<NPU_REG_ACT_TABLE_B9_POS))
#define NPU_REG_ACT_TABLE_BA                                    NPU_REG_ACT_TABLE_BA
#define NPU_REG_ACT_TABLE_BA_POS                                (16U)
#define NPU_REG_ACT_TABLE_BA_LEN                                (8U)
#define NPU_REG_ACT_TABLE_BA_MSK                                (((1U<<NPU_REG_ACT_TABLE_BA_LEN)-1)<<NPU_REG_ACT_TABLE_BA_POS)
#define NPU_REG_ACT_TABLE_BA_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_BA_LEN)-1)<<NPU_REG_ACT_TABLE_BA_POS))
#define NPU_REG_ACT_TABLE_BB                                    NPU_REG_ACT_TABLE_BB
#define NPU_REG_ACT_TABLE_BB_POS                                (24U)
#define NPU_REG_ACT_TABLE_BB_LEN                                (8U)
#define NPU_REG_ACT_TABLE_BB_MSK                                (((1U<<NPU_REG_ACT_TABLE_BB_LEN)-1)<<NPU_REG_ACT_TABLE_BB_POS)
#define NPU_REG_ACT_TABLE_BB_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_BB_LEN)-1)<<NPU_REG_ACT_TABLE_BB_POS))

/* 0x1BC : BLAI_ACT_TABLE_bF_bC */
#define NPU_BLAI_ACT_TABLE_BF_BC_OFFSET                         (0x1BC)
#define NPU_REG_ACT_TABLE_BC                                    NPU_REG_ACT_TABLE_BC
#define NPU_REG_ACT_TABLE_BC_POS                                (0U)
#define NPU_REG_ACT_TABLE_BC_LEN                                (8U)
#define NPU_REG_ACT_TABLE_BC_MSK                                (((1U<<NPU_REG_ACT_TABLE_BC_LEN)-1)<<NPU_REG_ACT_TABLE_BC_POS)
#define NPU_REG_ACT_TABLE_BC_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_BC_LEN)-1)<<NPU_REG_ACT_TABLE_BC_POS))
#define NPU_REG_ACT_TABLE_BD                                    NPU_REG_ACT_TABLE_BD
#define NPU_REG_ACT_TABLE_BD_POS                                (8U)
#define NPU_REG_ACT_TABLE_BD_LEN                                (8U)
#define NPU_REG_ACT_TABLE_BD_MSK                                (((1U<<NPU_REG_ACT_TABLE_BD_LEN)-1)<<NPU_REG_ACT_TABLE_BD_POS)
#define NPU_REG_ACT_TABLE_BD_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_BD_LEN)-1)<<NPU_REG_ACT_TABLE_BD_POS))
#define NPU_REG_ACT_TABLE_BE                                    NPU_REG_ACT_TABLE_BE
#define NPU_REG_ACT_TABLE_BE_POS                                (16U)
#define NPU_REG_ACT_TABLE_BE_LEN                                (8U)
#define NPU_REG_ACT_TABLE_BE_MSK                                (((1U<<NPU_REG_ACT_TABLE_BE_LEN)-1)<<NPU_REG_ACT_TABLE_BE_POS)
#define NPU_REG_ACT_TABLE_BE_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_BE_LEN)-1)<<NPU_REG_ACT_TABLE_BE_POS))
#define NPU_REG_ACT_TABLE_BF                                    NPU_REG_ACT_TABLE_BF
#define NPU_REG_ACT_TABLE_BF_POS                                (24U)
#define NPU_REG_ACT_TABLE_BF_LEN                                (8U)
#define NPU_REG_ACT_TABLE_BF_MSK                                (((1U<<NPU_REG_ACT_TABLE_BF_LEN)-1)<<NPU_REG_ACT_TABLE_BF_POS)
#define NPU_REG_ACT_TABLE_BF_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_BF_LEN)-1)<<NPU_REG_ACT_TABLE_BF_POS))

/* 0x1C0 : BLAI_ACT_TABLE_c3_c0 */
#define NPU_BLAI_ACT_TABLE_C3_C0_OFFSET                         (0x1C0)
#define NPU_REG_ACT_TABLE_C0                                    NPU_REG_ACT_TABLE_C0
#define NPU_REG_ACT_TABLE_C0_POS                                (0U)
#define NPU_REG_ACT_TABLE_C0_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C0_MSK                                (((1U<<NPU_REG_ACT_TABLE_C0_LEN)-1)<<NPU_REG_ACT_TABLE_C0_POS)
#define NPU_REG_ACT_TABLE_C0_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C0_LEN)-1)<<NPU_REG_ACT_TABLE_C0_POS))
#define NPU_REG_ACT_TABLE_C1                                    NPU_REG_ACT_TABLE_C1
#define NPU_REG_ACT_TABLE_C1_POS                                (8U)
#define NPU_REG_ACT_TABLE_C1_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C1_MSK                                (((1U<<NPU_REG_ACT_TABLE_C1_LEN)-1)<<NPU_REG_ACT_TABLE_C1_POS)
#define NPU_REG_ACT_TABLE_C1_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C1_LEN)-1)<<NPU_REG_ACT_TABLE_C1_POS))
#define NPU_REG_ACT_TABLE_C2                                    NPU_REG_ACT_TABLE_C2
#define NPU_REG_ACT_TABLE_C2_POS                                (16U)
#define NPU_REG_ACT_TABLE_C2_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C2_MSK                                (((1U<<NPU_REG_ACT_TABLE_C2_LEN)-1)<<NPU_REG_ACT_TABLE_C2_POS)
#define NPU_REG_ACT_TABLE_C2_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C2_LEN)-1)<<NPU_REG_ACT_TABLE_C2_POS))
#define NPU_REG_ACT_TABLE_C3                                    NPU_REG_ACT_TABLE_C3
#define NPU_REG_ACT_TABLE_C3_POS                                (24U)
#define NPU_REG_ACT_TABLE_C3_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C3_MSK                                (((1U<<NPU_REG_ACT_TABLE_C3_LEN)-1)<<NPU_REG_ACT_TABLE_C3_POS)
#define NPU_REG_ACT_TABLE_C3_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C3_LEN)-1)<<NPU_REG_ACT_TABLE_C3_POS))

/* 0x1C4 : BLAI_ACT_TABLE_c7_c4 */
#define NPU_BLAI_ACT_TABLE_C7_C4_OFFSET                         (0x1C4)
#define NPU_REG_ACT_TABLE_C4                                    NPU_REG_ACT_TABLE_C4
#define NPU_REG_ACT_TABLE_C4_POS                                (0U)
#define NPU_REG_ACT_TABLE_C4_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C4_MSK                                (((1U<<NPU_REG_ACT_TABLE_C4_LEN)-1)<<NPU_REG_ACT_TABLE_C4_POS)
#define NPU_REG_ACT_TABLE_C4_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C4_LEN)-1)<<NPU_REG_ACT_TABLE_C4_POS))
#define NPU_REG_ACT_TABLE_C5                                    NPU_REG_ACT_TABLE_C5
#define NPU_REG_ACT_TABLE_C5_POS                                (8U)
#define NPU_REG_ACT_TABLE_C5_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C5_MSK                                (((1U<<NPU_REG_ACT_TABLE_C5_LEN)-1)<<NPU_REG_ACT_TABLE_C5_POS)
#define NPU_REG_ACT_TABLE_C5_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C5_LEN)-1)<<NPU_REG_ACT_TABLE_C5_POS))
#define NPU_REG_ACT_TABLE_C6                                    NPU_REG_ACT_TABLE_C6
#define NPU_REG_ACT_TABLE_C6_POS                                (16U)
#define NPU_REG_ACT_TABLE_C6_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C6_MSK                                (((1U<<NPU_REG_ACT_TABLE_C6_LEN)-1)<<NPU_REG_ACT_TABLE_C6_POS)
#define NPU_REG_ACT_TABLE_C6_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C6_LEN)-1)<<NPU_REG_ACT_TABLE_C6_POS))
#define NPU_REG_ACT_TABLE_C7                                    NPU_REG_ACT_TABLE_C7
#define NPU_REG_ACT_TABLE_C7_POS                                (24U)
#define NPU_REG_ACT_TABLE_C7_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C7_MSK                                (((1U<<NPU_REG_ACT_TABLE_C7_LEN)-1)<<NPU_REG_ACT_TABLE_C7_POS)
#define NPU_REG_ACT_TABLE_C7_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C7_LEN)-1)<<NPU_REG_ACT_TABLE_C7_POS))

/* 0x1C8 : BLAI_ACT_TABLE_cB_c8 */
#define NPU_BLAI_ACT_TABLE_CB_C8_OFFSET                         (0x1C8)
#define NPU_REG_ACT_TABLE_C8                                    NPU_REG_ACT_TABLE_C8
#define NPU_REG_ACT_TABLE_C8_POS                                (0U)
#define NPU_REG_ACT_TABLE_C8_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C8_MSK                                (((1U<<NPU_REG_ACT_TABLE_C8_LEN)-1)<<NPU_REG_ACT_TABLE_C8_POS)
#define NPU_REG_ACT_TABLE_C8_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C8_LEN)-1)<<NPU_REG_ACT_TABLE_C8_POS))
#define NPU_REG_ACT_TABLE_C9                                    NPU_REG_ACT_TABLE_C9
#define NPU_REG_ACT_TABLE_C9_POS                                (8U)
#define NPU_REG_ACT_TABLE_C9_LEN                                (8U)
#define NPU_REG_ACT_TABLE_C9_MSK                                (((1U<<NPU_REG_ACT_TABLE_C9_LEN)-1)<<NPU_REG_ACT_TABLE_C9_POS)
#define NPU_REG_ACT_TABLE_C9_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_C9_LEN)-1)<<NPU_REG_ACT_TABLE_C9_POS))
#define NPU_REG_ACT_TABLE_CA                                    NPU_REG_ACT_TABLE_CA
#define NPU_REG_ACT_TABLE_CA_POS                                (16U)
#define NPU_REG_ACT_TABLE_CA_LEN                                (8U)
#define NPU_REG_ACT_TABLE_CA_MSK                                (((1U<<NPU_REG_ACT_TABLE_CA_LEN)-1)<<NPU_REG_ACT_TABLE_CA_POS)
#define NPU_REG_ACT_TABLE_CA_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_CA_LEN)-1)<<NPU_REG_ACT_TABLE_CA_POS))
#define NPU_REG_ACT_TABLE_CB                                    NPU_REG_ACT_TABLE_CB
#define NPU_REG_ACT_TABLE_CB_POS                                (24U)
#define NPU_REG_ACT_TABLE_CB_LEN                                (8U)
#define NPU_REG_ACT_TABLE_CB_MSK                                (((1U<<NPU_REG_ACT_TABLE_CB_LEN)-1)<<NPU_REG_ACT_TABLE_CB_POS)
#define NPU_REG_ACT_TABLE_CB_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_CB_LEN)-1)<<NPU_REG_ACT_TABLE_CB_POS))

