bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x1CC : BLAI_ACT_TABLE_cF_cC */
#define NPU_BLAI_ACT_TABLE_CF_CC_OFFSET                         (0x1CC)
#define NPU_REG_ACT_TABLE_CC                                    NPU_REG_ACT_TABLE_CC
#define NPU_REG_ACT_TABLE_CC_POS                                (0U)
#define NPU_REG_ACT_TABLE_CC_LEN                                (8U)
#define NPU_REG_ACT_TABLE_CC_MSK                                (((1U<<NPU_REG_ACT_TABLE_CC_LEN)-1)<<NPU_REG_ACT_TABLE_CC_POS)
#define NPU_REG_ACT_TABLE_CC_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_CC_LEN)-1)<<NPU_REG_ACT_TABLE_CC_POS))
#define NPU_REG_ACT_TABLE_CD                                    NPU_REG_ACT_TABLE_CD
#define NPU_REG_ACT_TABLE_CD_POS                                (8U)
#define NPU_REG_ACT_TABLE_CD_LEN                                (8U)
#define NPU_REG_ACT_TABLE_CD_MSK                                (((1U<<NPU_REG_ACT_TABLE_CD_LEN)-1)<<NPU_REG_ACT_TABLE_CD_POS)
#define NPU_REG_ACT_TABLE_CD_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_CD_LEN)-1)<<NPU_REG_ACT_TABLE_CD_POS))
#define NPU_REG_ACT_TABLE_CE                                    NPU_REG_ACT_TABLE_CE
#define NPU_REG_ACT_TABLE_CE_POS                                (16U)
#define NPU_REG_ACT_TABLE_CE_LEN                                (8U)
#define NPU_REG_ACT_TABLE_CE_MSK                                (((1U<<NPU_REG_ACT_TABLE_CE_LEN)-1)<<NPU_REG_ACT_TABLE_CE_POS)
#define NPU_REG_ACT_TABLE_CE_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_CE_LEN)-1)<<NPU_REG_ACT_TABLE_CE_POS))
#define NPU_REG_ACT_TABLE_CF                                    NPU_REG_ACT_TABLE_CF
#define NPU_REG_ACT_TABLE_CF_POS                                (24U)
#define NPU_REG_ACT_TABLE_CF_LEN                                (8U)
#define NPU_REG_ACT_TABLE_CF_MSK                                (((1U<<NPU_REG_ACT_TABLE_CF_LEN)-1)<<NPU_REG_ACT_TABLE_CF_POS)
#define NPU_REG_ACT_TABLE_CF_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_CF_LEN)-1)<<NPU_REG_ACT_TABLE_CF_POS))

/* 0x1D0 : BLAI_ACT_TABLE_d3_d0 */
#define NPU_BLAI_ACT_TABLE_D3_D0_OFFSET                         (0x1D0)
#define NPU_REG_ACT_TABLE_D0                                    NPU_REG_ACT_TABLE_D0
#define NPU_REG_ACT_TABLE_D0_POS                                (0U)
#define NPU_REG_ACT_TABLE_D0_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D0_MSK                                (((1U<<NPU_REG_ACT_TABLE_D0_LEN)-1)<<NPU_REG_ACT_TABLE_D0_POS)
#define NPU_REG_ACT_TABLE_D0_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D0_LEN)-1)<<NPU_REG_ACT_TABLE_D0_POS))
#define NPU_REG_ACT_TABLE_D1                                    NPU_REG_ACT_TABLE_D1
#define NPU_REG_ACT_TABLE_D1_POS                                (8U)
#define NPU_REG_ACT_TABLE_D1_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D1_MSK                                (((1U<<NPU_REG_ACT_TABLE_D1_LEN)-1)<<NPU_REG_ACT_TABLE_D1_POS)
#define NPU_REG_ACT_TABLE_D1_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D1_LEN)-1)<<NPU_REG_ACT_TABLE_D1_POS))
#define NPU_REG_ACT_TABLE_D2                                    NPU_REG_ACT_TABLE_D2
#define NPU_REG_ACT_TABLE_D2_POS                                (16U)
#define NPU_REG_ACT_TABLE_D2_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D2_MSK                                (((1U<<NPU_REG_ACT_TABLE_D2_LEN)-1)<<NPU_REG_ACT_TABLE_D2_POS)
#define NPU_REG_ACT_TABLE_D2_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D2_LEN)-1)<<NPU_REG_ACT_TABLE_D2_POS))
#define NPU_REG_ACT_TABLE_D3                                    NPU_REG_ACT_TABLE_D3
#define NPU_REG_ACT_TABLE_D3_POS                                (24U)
#define NPU_REG_ACT_TABLE_D3_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D3_MSK                                (((1U<<NPU_REG_ACT_TABLE_D3_LEN)-1)<<NPU_REG_ACT_TABLE_D3_POS)
#define NPU_REG_ACT_TABLE_D3_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D3_LEN)-1)<<NPU_REG_ACT_TABLE_D3_POS))

/* 0x1D4 : BLAI_ACT_TABLE_d7_d4 */
#define NPU_BLAI_ACT_TABLE_D7_D4_OFFSET                         (0x1D4)
#define NPU_REG_ACT_TABLE_D4                                    NPU_REG_ACT_TABLE_D4
#define NPU_REG_ACT_TABLE_D4_POS                                (0U)
#define NPU_REG_ACT_TABLE_D4_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D4_MSK                                (((1U<<NPU_REG_ACT_TABLE_D4_LEN)-1)<<NPU_REG_ACT_TABLE_D4_POS)
#define NPU_REG_ACT_TABLE_D4_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D4_LEN)-1)<<NPU_REG_ACT_TABLE_D4_POS))
#define NPU_REG_ACT_TABLE_D5                                    NPU_REG_ACT_TABLE_D5
#define NPU_REG_ACT_TABLE_D5_POS                                (8U)
#define NPU_REG_ACT_TABLE_D5_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D5_MSK                                (((1U<<NPU_REG_ACT_TABLE_D5_LEN)-1)<<NPU_REG_ACT_TABLE_D5_POS)
#define NPU_REG_ACT_TABLE_D5_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D5_LEN)-1)<<NPU_REG_ACT_TABLE_D5_POS))
#define NPU_REG_ACT_TABLE_D6                                    NPU_REG_ACT_TABLE_D6
#define NPU_REG_ACT_TABLE_D6_POS                                (16U)
#define NPU_REG_ACT_TABLE_D6_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D6_MSK                                (((1U<<NPU_REG_ACT_TABLE_D6_LEN)-1)<<NPU_REG_ACT_TABLE_D6_POS)
#define NPU_REG_ACT_TABLE_D6_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D6_LEN)-1)<<NPU_REG_ACT_TABLE_D6_POS))
#define NPU_REG_ACT_TABLE_D7                                    NPU_REG_ACT_TABLE_D7
#define NPU_REG_ACT_TABLE_D7_POS                                (24U)
#define NPU_REG_ACT_TABLE_D7_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D7_MSK                                (((1U<<NPU_REG_ACT_TABLE_D7_LEN)-1)<<NPU_REG_ACT_TABLE_D7_POS)
#define NPU_REG_ACT_TABLE_D7_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D7_LEN)-1)<<NPU_REG_ACT_TABLE_D7_POS))

/* 0x1D8 : BLAI_ACT_TABLE_dB_d8 */
#define NPU_BLAI_ACT_TABLE_DB_D8_OFFSET                         (0x1D8)
#define NPU_REG_ACT_TABLE_D8                                    NPU_REG_ACT_TABLE_D8
#define NPU_REG_ACT_TABLE_D8_POS                                (0U)
#define NPU_REG_ACT_TABLE_D8_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D8_MSK                                (((1U<<NPU_REG_ACT_TABLE_D8_LEN)-1)<<NPU_REG_ACT_TABLE_D8_POS)
#define NPU_REG_ACT_TABLE_D8_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D8_LEN)-1)<<NPU_REG_ACT_TABLE_D8_POS))
#define NPU_REG_ACT_TABLE_D9                                    NPU_REG_ACT_TABLE_D9
#define NPU_REG_ACT_TABLE_D9_POS                                (8U)
#define NPU_REG_ACT_TABLE_D9_LEN                                (8U)
#define NPU_REG_ACT_TABLE_D9_MSK                                (((1U<<NPU_REG_ACT_TABLE_D9_LEN)-1)<<NPU_REG_ACT_TABLE_D9_POS)
#define NPU_REG_ACT_TABLE_D9_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_D9_LEN)-1)<<NPU_REG_ACT_TABLE_D9_POS))
#define NPU_REG_ACT_TABLE_DA                                    NPU_REG_ACT_TABLE_DA
#define NPU_REG_ACT_TABLE_DA_POS                                (16U)
#define NPU_REG_ACT_TABLE_DA_LEN                                (8U)
#define NPU_REG_ACT_TABLE_DA_MSK                                (((1U<<NPU_REG_ACT_TABLE_DA_LEN)-1)<<NPU_REG_ACT_TABLE_DA_POS)
#define NPU_REG_ACT_TABLE_DA_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_DA_LEN)-1)<<NPU_REG_ACT_TABLE_DA_POS))
#define NPU_REG_ACT_TABLE_DB                                    NPU_REG_ACT_TABLE_DB
#define NPU_REG_ACT_TABLE_DB_POS                                (24U)
#define NPU_REG_ACT_TABLE_DB_LEN                                (8U)
#define NPU_REG_ACT_TABLE_DB_MSK                                (((1U<<NPU_REG_ACT_TABLE_DB_LEN)-1)<<NPU_REG_ACT_TABLE_DB_POS)
#define NPU_REG_ACT_TABLE_DB_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_DB_LEN)-1)<<NPU_REG_ACT_TABLE_DB_POS))

/* 0x1DC : BLAI_ACT_TABLE_dF_dC */
#define NPU_BLAI_ACT_TABLE_DF_DC_OFFSET                         (0x1DC)
#define NPU_REG_ACT_TABLE_DC                                    NPU_REG_ACT_TABLE_DC
#define NPU_REG_ACT_TABLE_DC_POS                                (0U)
#define NPU_REG_ACT_TABLE_DC_LEN                                (8U)
#define NPU_REG_ACT_TABLE_DC_MSK                                (((1U<<NPU_REG_ACT_TABLE_DC_LEN)-1)<<NPU_REG_ACT_TABLE_DC_POS)
#define NPU_REG_ACT_TABLE_DC_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_DC_LEN)-1)<<NPU_REG_ACT_TABLE_DC_POS))
#define NPU_REG_ACT_TABLE_DD                                    NPU_REG_ACT_TABLE_DD
#define NPU_REG_ACT_TABLE_DD_POS                                (8U)
#define NPU_REG_ACT_TABLE_DD_LEN                                (8U)
#define NPU_REG_ACT_TABLE_DD_MSK                                (((1U<<NPU_REG_ACT_TABLE_DD_LEN)-1)<<NPU_REG_ACT_TABLE_DD_POS)
#define NPU_REG_ACT_TABLE_DD_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_DD_LEN)-1)<<NPU_REG_ACT_TABLE_DD_POS))
#define NPU_REG_ACT_TABLE_DE                                    NPU_REG_ACT_TABLE_DE
#define NPU_REG_ACT_TABLE_DE_POS                                (16U)
#define NPU_REG_ACT_TABLE_DE_LEN                                (8U)
#define NPU_REG_ACT_TABLE_DE_MSK                                (((1U<<NPU_REG_ACT_TABLE_DE_LEN)-1)<<NPU_REG_ACT_TABLE_DE_POS)
#define NPU_REG_ACT_TABLE_DE_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_DE_LEN)-1)<<NPU_REG_ACT_TABLE_DE_POS))
#define NPU_REG_ACT_TABLE_DF                                    NPU_REG_ACT_TABLE_DF
#define NPU_REG_ACT_TABLE_DF_POS                                (24U)
#define NPU_REG_ACT_TABLE_DF_LEN                                (8U)
#define NPU_REG_ACT_TABLE_DF_MSK                                (((1U<<NPU_REG_ACT_TABLE_DF_LEN)-1)<<NPU_REG_ACT_TABLE_DF_POS)
#define NPU_REG_ACT_TABLE_DF_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_DF_LEN)-1)<<NPU_REG_ACT_TABLE_DF_POS))

/* 0x1E0 : BLAI_ACT_TABLE_e3_e0 */
#define NPU_BLAI_ACT_TABLE_E3_E0_OFFSET                         (0x1E0)
#define NPU_REG_ACT_TABLE_E0                                    NPU_REG_ACT_TABLE_E0
#define NPU_REG_ACT_TABLE_E0_POS                                (0U)
#define NPU_REG_ACT_TABLE_E0_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E0_MSK                                (((1U<<NPU_REG_ACT_TABLE_E0_LEN)-1)<<NPU_REG_ACT_TABLE_E0_POS)
#define NPU_REG_ACT_TABLE_E0_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E0_LEN)-1)<<NPU_REG_ACT_TABLE_E0_POS))
#define NPU_REG_ACT_TABLE_E1                                    NPU_REG_ACT_TABLE_E1
#define NPU_REG_ACT_TABLE_E1_POS                                (8U)
#define NPU_REG_ACT_TABLE_E1_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E1_MSK                                (((1U<<NPU_REG_ACT_TABLE_E1_LEN)-1)<<NPU_REG_ACT_TABLE_E1_POS)
#define NPU_REG_ACT_TABLE_E1_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E1_LEN)-1)<<NPU_REG_ACT_TABLE_E1_POS))
#define NPU_REG_ACT_TABLE_E2                                    NPU_REG_ACT_TABLE_E2
#define NPU_REG_ACT_TABLE_E2_POS                                (16U)
#define NPU_REG_ACT_TABLE_E2_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E2_MSK                                (((1U<<NPU_REG_ACT_TABLE_E2_LEN)-1)<<NPU_REG_ACT_TABLE_E2_POS)
#define NPU_REG_ACT_TABLE_E2_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E2_LEN)-1)<<NPU_REG_ACT_TABLE_E2_POS))
#define NPU_REG_ACT_TABLE_E3                                    NPU_REG_ACT_TABLE_E3
#define NPU_REG_ACT_TABLE_E3_POS                                (24U)
#define NPU_REG_ACT_TABLE_E3_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E3_MSK                                (((1U<<NPU_REG_ACT_TABLE_E3_LEN)-1)<<NPU_REG_ACT_TABLE_E3_POS)
#define NPU_REG_ACT_TABLE_E3_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E3_LEN)-1)<<NPU_REG_ACT_TABLE_E3_POS))

/* 0x1E4 : BLAI_ACT_TABLE_e7_e4 */
#define NPU_BLAI_ACT_TABLE_E7_E4_OFFSET                         (0x1E4)
#define NPU_REG_ACT_TABLE_E4                                    NPU_REG_ACT_TABLE_E4
#define NPU_REG_ACT_TABLE_E4_POS                                (0U)
#define NPU_REG_ACT_TABLE_E4_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E4_MSK                                (((1U<<NPU_REG_ACT_TABLE_E4_LEN)-1)<<NPU_REG_ACT_TABLE_E4_POS)
#define NPU_REG_ACT_TABLE_E4_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E4_LEN)-1)<<NPU_REG_ACT_TABLE_E4_POS))
#define NPU_REG_ACT_TABLE_E5                                    NPU_REG_ACT_TABLE_E5
#define NPU_REG_ACT_TABLE_E5_POS                                (8U)
#define NPU_REG_ACT_TABLE_E5_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E5_MSK                                (((1U<<NPU_REG_ACT_TABLE_E5_LEN)-1)<<NPU_REG_ACT_TABLE_E5_POS)
#define NPU_REG_ACT_TABLE_E5_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E5_LEN)-1)<<NPU_REG_ACT_TABLE_E5_POS))
#define NPU_REG_ACT_TABLE_E6                                    NPU_REG_ACT_TABLE_E6
#define NPU_REG_ACT_TABLE_E6_POS                                (16U)
#define NPU_REG_ACT_TABLE_E6_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E6_MSK                                (((1U<<NPU_REG_ACT_TABLE_E6_LEN)-1)<<NPU_REG_ACT_TABLE_E6_POS)
#define NPU_REG_ACT_TABLE_E6_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E6_LEN)-1)<<NPU_REG_ACT_TABLE_E6_POS))
#define NPU_REG_ACT_TABLE_E7                                    NPU_REG_ACT_TABLE_E7
#define NPU_REG_ACT_TABLE_E7_POS                                (24U)
#define NPU_REG_ACT_TABLE_E7_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E7_MSK                                (((1U<<NPU_REG_ACT_TABLE_E7_LEN)-1)<<NPU_REG_ACT_TABLE_E7_POS)
#define NPU_REG_ACT_TABLE_E7_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E7_LEN)-1)<<NPU_REG_ACT_TABLE_E7_POS))

