bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x1E8 : BLAI_ACT_TABLE_eB_e8 */
#define NPU_BLAI_ACT_TABLE_EB_E8_OFFSET                         (0x1E8)
#define NPU_REG_ACT_TABLE_E8                                    NPU_REG_ACT_TABLE_E8
#define NPU_REG_ACT_TABLE_E8_POS                                (0U)
#define NPU_REG_ACT_TABLE_E8_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E8_MSK                                (((1U<<NPU_REG_ACT_TABLE_E8_LEN)-1)<<NPU_REG_ACT_TABLE_E8_POS)
#define NPU_REG_ACT_TABLE_E8_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E8_LEN)-1)<<NPU_REG_ACT_TABLE_E8_POS))
#define NPU_REG_ACT_TABLE_E9                                    NPU_REG_ACT_TABLE_E9
#define NPU_REG_ACT_TABLE_E9_POS                                (8U)
#define NPU_REG_ACT_TABLE_E9_LEN                                (8U)
#define NPU_REG_ACT_TABLE_E9_MSK                                (((1U<<NPU_REG_ACT_TABLE_E9_LEN)-1)<<NPU_REG_ACT_TABLE_E9_POS)
#define NPU_REG_ACT_TABLE_E9_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_E9_LEN)-1)<<NPU_REG_ACT_TABLE_E9_POS))
#define NPU_REG_ACT_TABLE_EA                                    NPU_REG_ACT_TABLE_EA
#define NPU_REG_ACT_TABLE_EA_POS                                (16U)
#define NPU_REG_ACT_TABLE_EA_LEN                                (8U)
#define NPU_REG_ACT_TABLE_EA_MSK                                (((1U<<NPU_REG_ACT_TABLE_EA_LEN)-1)<<NPU_REG_ACT_TABLE_EA_POS)
#define NPU_REG_ACT_TABLE_EA_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_EA_LEN)-1)<<NPU_REG_ACT_TABLE_EA_POS))
#define NPU_REG_ACT_TABLE_EB                                    NPU_REG_ACT_TABLE_EB
#define NPU_REG_ACT_TABLE_EB_POS                                (24U)
#define NPU_REG_ACT_TABLE_EB_LEN                                (8U)
#define NPU_REG_ACT_TABLE_EB_MSK                                (((1U<<NPU_REG_ACT_TABLE_EB_LEN)-1)<<NPU_REG_ACT_TABLE_EB_POS)
#define NPU_REG_ACT_TABLE_EB_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_EB_LEN)-1)<<NPU_REG_ACT_TABLE_EB_POS))

/* 0x1EC : BLAI_ACT_TABLE_eF_eC */
#define NPU_BLAI_ACT_TABLE_EF_EC_OFFSET                         (0x1EC)
#define NPU_REG_ACT_TABLE_EC                                    NPU_REG_ACT_TABLE_EC
#define NPU_REG_ACT_TABLE_EC_POS                                (0U)
#define NPU_REG_ACT_TABLE_EC_LEN                                (8U)
#define NPU_REG_ACT_TABLE_EC_MSK                                (((1U<<NPU_REG_ACT_TABLE_EC_LEN)-1)<<NPU_REG_ACT_TABLE_EC_POS)
#define NPU_REG_ACT_TABLE_EC_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_EC_LEN)-1)<<NPU_REG_ACT_TABLE_EC_POS))
#define NPU_REG_ACT_TABLE_ED                                    NPU_REG_ACT_TABLE_ED
#define NPU_REG_ACT_TABLE_ED_POS                                (8U)
#define NPU_REG_ACT_TABLE_ED_LEN                                (8U)
#define NPU_REG_ACT_TABLE_ED_MSK                                (((1U<<NPU_REG_ACT_TABLE_ED_LEN)-1)<<NPU_REG_ACT_TABLE_ED_POS)
#define NPU_REG_ACT_TABLE_ED_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_ED_LEN)-1)<<NPU_REG_ACT_TABLE_ED_POS))
#define NPU_REG_ACT_TABLE_EE                                    NPU_REG_ACT_TABLE_EE
#define NPU_REG_ACT_TABLE_EE_POS                                (16U)
#define NPU_REG_ACT_TABLE_EE_LEN                                (8U)
#define NPU_REG_ACT_TABLE_EE_MSK                                (((1U<<NPU_REG_ACT_TABLE_EE_LEN)-1)<<NPU_REG_ACT_TABLE_EE_POS)
#define NPU_REG_ACT_TABLE_EE_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_EE_LEN)-1)<<NPU_REG_ACT_TABLE_EE_POS))
#define NPU_REG_ACT_TABLE_EF                                    NPU_REG_ACT_TABLE_EF
#define NPU_REG_ACT_TABLE_EF_POS                                (24U)
#define NPU_REG_ACT_TABLE_EF_LEN                                (8U)
#define NPU_REG_ACT_TABLE_EF_MSK                                (((1U<<NPU_REG_ACT_TABLE_EF_LEN)-1)<<NPU_REG_ACT_TABLE_EF_POS)
#define NPU_REG_ACT_TABLE_EF_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_EF_LEN)-1)<<NPU_REG_ACT_TABLE_EF_POS))

/* 0x1F0 : BLAI_ACT_TABLE_f3_f0 */
#define NPU_BLAI_ACT_TABLE_F3_F0_OFFSET                         (0x1F0)
#define NPU_REG_ACT_TABLE_F0                                    NPU_REG_ACT_TABLE_F0
#define NPU_REG_ACT_TABLE_F0_POS                                (0U)
#define NPU_REG_ACT_TABLE_F0_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F0_MSK                                (((1U<<NPU_REG_ACT_TABLE_F0_LEN)-1)<<NPU_REG_ACT_TABLE_F0_POS)
#define NPU_REG_ACT_TABLE_F0_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F0_LEN)-1)<<NPU_REG_ACT_TABLE_F0_POS))
#define NPU_REG_ACT_TABLE_F1                                    NPU_REG_ACT_TABLE_F1
#define NPU_REG_ACT_TABLE_F1_POS                                (8U)
#define NPU_REG_ACT_TABLE_F1_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F1_MSK                                (((1U<<NPU_REG_ACT_TABLE_F1_LEN)-1)<<NPU_REG_ACT_TABLE_F1_POS)
#define NPU_REG_ACT_TABLE_F1_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F1_LEN)-1)<<NPU_REG_ACT_TABLE_F1_POS))
#define NPU_REG_ACT_TABLE_F2                                    NPU_REG_ACT_TABLE_F2
#define NPU_REG_ACT_TABLE_F2_POS                                (16U)
#define NPU_REG_ACT_TABLE_F2_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F2_MSK                                (((1U<<NPU_REG_ACT_TABLE_F2_LEN)-1)<<NPU_REG_ACT_TABLE_F2_POS)
#define NPU_REG_ACT_TABLE_F2_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F2_LEN)-1)<<NPU_REG_ACT_TABLE_F2_POS))
#define NPU_REG_ACT_TABLE_F3                                    NPU_REG_ACT_TABLE_F3
#define NPU_REG_ACT_TABLE_F3_POS                                (24U)
#define NPU_REG_ACT_TABLE_F3_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F3_MSK                                (((1U<<NPU_REG_ACT_TABLE_F3_LEN)-1)<<NPU_REG_ACT_TABLE_F3_POS)
#define NPU_REG_ACT_TABLE_F3_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F3_LEN)-1)<<NPU_REG_ACT_TABLE_F3_POS))

/* 0x1F4 : BLAI_ACT_TABLE_f7_f4 */
#define NPU_BLAI_ACT_TABLE_F7_F4_OFFSET                         (0x1F4)
#define NPU_REG_ACT_TABLE_F4                                    NPU_REG_ACT_TABLE_F4
#define NPU_REG_ACT_TABLE_F4_POS                                (0U)
#define NPU_REG_ACT_TABLE_F4_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F4_MSK                                (((1U<<NPU_REG_ACT_TABLE_F4_LEN)-1)<<NPU_REG_ACT_TABLE_F4_POS)
#define NPU_REG_ACT_TABLE_F4_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F4_LEN)-1)<<NPU_REG_ACT_TABLE_F4_POS))
#define NPU_REG_ACT_TABLE_F5                                    NPU_REG_ACT_TABLE_F5
#define NPU_REG_ACT_TABLE_F5_POS                                (8U)
#define NPU_REG_ACT_TABLE_F5_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F5_MSK                                (((1U<<NPU_REG_ACT_TABLE_F5_LEN)-1)<<NPU_REG_ACT_TABLE_F5_POS)
#define NPU_REG_ACT_TABLE_F5_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F5_LEN)-1)<<NPU_REG_ACT_TABLE_F5_POS))
#define NPU_REG_ACT_TABLE_F6                                    NPU_REG_ACT_TABLE_F6
#define NPU_REG_ACT_TABLE_F6_POS                                (16U)
#define NPU_REG_ACT_TABLE_F6_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F6_MSK                                (((1U<<NPU_REG_ACT_TABLE_F6_LEN)-1)<<NPU_REG_ACT_TABLE_F6_POS)
#define NPU_REG_ACT_TABLE_F6_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F6_LEN)-1)<<NPU_REG_ACT_TABLE_F6_POS))
#define NPU_REG_ACT_TABLE_F7                                    NPU_REG_ACT_TABLE_F7
#define NPU_REG_ACT_TABLE_F7_POS                                (24U)
#define NPU_REG_ACT_TABLE_F7_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F7_MSK                                (((1U<<NPU_REG_ACT_TABLE_F7_LEN)-1)<<NPU_REG_ACT_TABLE_F7_POS)
#define NPU_REG_ACT_TABLE_F7_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F7_LEN)-1)<<NPU_REG_ACT_TABLE_F7_POS))

