bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
/* 0x1F8 : BLAI_ACT_TABLE_fB_f8 */
#define NPU_BLAI_ACT_TABLE_FB_F8_OFFSET                         (0x1F8)
#define NPU_REG_ACT_TABLE_F8                                    NPU_REG_ACT_TABLE_F8
#define NPU_REG_ACT_TABLE_F8_POS                                (0U)
#define NPU_REG_ACT_TABLE_F8_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F8_MSK                                (((1U<<NPU_REG_ACT_TABLE_F8_LEN)-1)<<NPU_REG_ACT_TABLE_F8_POS)
#define NPU_REG_ACT_TABLE_F8_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F8_LEN)-1)<<NPU_REG_ACT_TABLE_F8_POS))
#define NPU_REG_ACT_TABLE_F9                                    NPU_REG_ACT_TABLE_F9
#define NPU_REG_ACT_TABLE_F9_POS                                (8U)
#define NPU_REG_ACT_TABLE_F9_LEN                                (8U)
#define NPU_REG_ACT_TABLE_F9_MSK                                (((1U<<NPU_REG_ACT_TABLE_F9_LEN)-1)<<NPU_REG_ACT_TABLE_F9_POS)
#define NPU_REG_ACT_TABLE_F9_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_F9_LEN)-1)<<NPU_REG_ACT_TABLE_F9_POS))
#define NPU_REG_ACT_TABLE_FA                                    NPU_REG_ACT_TABLE_FA
#define NPU_REG_ACT_TABLE_FA_POS                                (16U)
#define NPU_REG_ACT_TABLE_FA_LEN                                (8U)
#define NPU_REG_ACT_TABLE_FA_MSK                                (((1U<<NPU_REG_ACT_TABLE_FA_LEN)-1)<<NPU_REG_ACT_TABLE_FA_POS)
#define NPU_REG_ACT_TABLE_FA_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_FA_LEN)-1)<<NPU_REG_ACT_TABLE_FA_POS))
#define NPU_REG_ACT_TABLE_FB                                    NPU_REG_ACT_TABLE_FB
#define NPU_REG_ACT_TABLE_FB_POS                                (24U)
#define NPU_REG_ACT_TABLE_FB_LEN                                (8U)
#define NPU_REG_ACT_TABLE_FB_MSK                                (((1U<<NPU_REG_ACT_TABLE_FB_LEN)-1)<<NPU_REG_ACT_TABLE_FB_POS)
#define NPU_REG_ACT_TABLE_FB_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_FB_LEN)-1)<<NPU_REG_ACT_TABLE_FB_POS))

/* 0x1FC : BLAI_ACT_TABLE_fF_fC */
#define NPU_BLAI_ACT_TABLE_FF_FC_OFFSET                         (0x1FC)
#define NPU_REG_ACT_TABLE_FC                                    NPU_REG_ACT_TABLE_FC
#define NPU_REG_ACT_TABLE_FC_POS                                (0U)
#define NPU_REG_ACT_TABLE_FC_LEN                                (8U)
#define NPU_REG_ACT_TABLE_FC_MSK                                (((1U<<NPU_REG_ACT_TABLE_FC_LEN)-1)<<NPU_REG_ACT_TABLE_FC_POS)
#define NPU_REG_ACT_TABLE_FC_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_FC_LEN)-1)<<NPU_REG_ACT_TABLE_FC_POS))
#define NPU_REG_ACT_TABLE_FD                                    NPU_REG_ACT_TABLE_FD
#define NPU_REG_ACT_TABLE_FD_POS                                (8U)
#define NPU_REG_ACT_TABLE_FD_LEN                                (8U)
#define NPU_REG_ACT_TABLE_FD_MSK                                (((1U<<NPU_REG_ACT_TABLE_FD_LEN)-1)<<NPU_REG_ACT_TABLE_FD_POS)
#define NPU_REG_ACT_TABLE_FD_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_FD_LEN)-1)<<NPU_REG_ACT_TABLE_FD_POS))
#define NPU_REG_ACT_TABLE_FE                                    NPU_REG_ACT_TABLE_FE
#define NPU_REG_ACT_TABLE_FE_POS                                (16U)
#define NPU_REG_ACT_TABLE_FE_LEN                                (8U)
#define NPU_REG_ACT_TABLE_FE_MSK                                (((1U<<NPU_REG_ACT_TABLE_FE_LEN)-1)<<NPU_REG_ACT_TABLE_FE_POS)
#define NPU_REG_ACT_TABLE_FE_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_FE_LEN)-1)<<NPU_REG_ACT_TABLE_FE_POS))
#define NPU_REG_ACT_TABLE_FF                                    NPU_REG_ACT_TABLE_FF
#define NPU_REG_ACT_TABLE_FF_POS                                (24U)
#define NPU_REG_ACT_TABLE_FF_LEN                                (8U)
#define NPU_REG_ACT_TABLE_FF_MSK                                (((1U<<NPU_REG_ACT_TABLE_FF_LEN)-1)<<NPU_REG_ACT_TABLE_FF_POS)
#define NPU_REG_ACT_TABLE_FF_UMSK                               (~(((1U<<NPU_REG_ACT_TABLE_FF_LEN)-1)<<NPU_REG_ACT_TABLE_FF_POS))


struct  npu_reg {
    /* 0x00 : BALI_GENERAL_CFG */
    union {
        struct {
            uint32_t reserved_0_7                   :  8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t reg_img_in_mode                :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t reg_ftable_idx_base            :  6; /* [21:16],        r/w,        0x5 */
            uint32_t reserved_22_23                 :  2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_ftable_dat_base            :  6; /* [29:24],        r/w,        0x7 */
            uint32_t axi_w_idle                     :  1; /* [   30],          r,        0x0 */
            uint32_t axi_r_idle                     :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } BALI_GENERAL_CFG;

    /* 0x04 : BLAI_INT_CFG */
    union {
        struct {
            uint32_t reg_blai_start                 :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_blai_stop                  :  1; /* [    1],        w1p,        0x0 */
            uint32_t reg_blai_resume                :  1; /* [    2],        w1p,        0x0 */
            uint32_t reserved_3_7                   :  5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t reg_int_clr                    :  1; /* [    8],        w1p,        0x0 */
            uint32_t sts_blai_int                   :  1; /* [    9],          r,        0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } BLAI_INT_CFG;

    /* 0x8  reserved */
    uint8_t RESERVED0x8[8];

    /* 0x10 : BLAI_WEIGHT_ADDR */
    union {
        struct {
            uint32_t reg_weig_addr_base             : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } BLAI_WEIGHT_ADDR;

    /* 0x14 : BLAI_BIAS_ADDR */
    union {
        struct {
            uint32_t reg_bias_addr_base             : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } BLAI_BIAS_ADDR;

    /* 0x18 : BLAI_INST_ADDR */
    union {
        struct {
            uint32_t reg_inst_addr_base             : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } BLAI_INST_ADDR;

