bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
    /* 0x1C : APU_DM0_ADDR */
    union {
        struct {
            uint32_t reg_img_addr_base              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } APU_DM0_ADDR;

    /* 0x20 : APU_DM1_ADDR */
    union {
        struct {
            uint32_t reg_img_mem_seg                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } APU_DM1_ADDR;

    /* 0x24 : BLAI_TF_CFG0 */
    union {
        struct {
            uint32_t reserved_0_30                  : 31; /* [30: 0],        r/w,        0x0 */
            uint32_t reg_tenflow_en                 :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } BLAI_TF_CFG0;

    /* 0x28  reserved */
    uint8_t RESERVED0x24[216];

    /* 0x100 : BLAI_ACT_TABLE00 */
    union {
        struct {
            uint32_t reg_act_table_00               :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_act_table_01               :  8; /* [15: 8],        r/w,       0xfb */
            uint32_t reg_act_table_02               :  8; /* [23:16],        r/w,       0xf7 */
            uint32_t reg_act_table_03               :  8; /* [31:24],        r/w,       0xf2 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE00;

    /* 0x104 : BLAI_ACT_TABLE07_04 */
    union {
        struct {
            uint32_t reg_act_table_04               :  8; /* [ 7: 0],        r/w,       0xee */
            uint32_t reg_act_table_05               :  8; /* [15: 8],        r/w,       0xea */
            uint32_t reg_act_table_06               :  8; /* [23:16],        r/w,       0xe6 */
            uint32_t reg_act_table_07               :  8; /* [31:24],        r/w,       0xe2 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE07_04;

    /* 0x108 : BLAI_ACT_TABLE0B_08 */
    union {
        struct {
            uint32_t reg_act_table_08               :  8; /* [ 7: 0],        r/w,       0xdf */
            uint32_t reg_act_table_09               :  8; /* [15: 8],        r/w,       0xdb */
            uint32_t reg_act_table_0a               :  8; /* [23:16],        r/w,       0xd8 */
            uint32_t reg_act_table_0b               :  8; /* [31:24],        r/w,       0xd5 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE0B_08;

    /* 0x10C : BLAI_ACT_TABLE0F_0C */
    union {
        struct {
            uint32_t reg_act_table_0c               :  8; /* [ 7: 0],        r/w,       0xd2 */
            uint32_t reg_act_table_0d               :  8; /* [15: 8],        r/w,       0xcf */
            uint32_t reg_act_table_0e               :  8; /* [23:16],        r/w,       0xcc */
            uint32_t reg_act_table_0f               :  8; /* [31:24],        r/w,       0xca */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE0F_0C;

    /* 0x110 : BLAI_ACT_TABLE13_10 */
    union {
        struct {
            uint32_t reg_act_table_10               :  8; /* [ 7: 0],        r/w,       0xc7 */
            uint32_t reg_act_table_11               :  8; /* [15: 8],        r/w,       0xc5 */
            uint32_t reg_act_table_12               :  8; /* [23:16],        r/w,       0xc3 */
            uint32_t reg_act_table_13               :  8; /* [31:24],        r/w,       0xc1 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE13_10;

    /* 0x114 : BLAI_ACT_TABLE17_14 */
    union {
        struct {
            uint32_t reg_act_table_14               :  8; /* [ 7: 0],        r/w,       0xbf */
            uint32_t reg_act_table_15               :  8; /* [15: 8],        r/w,       0xbe */
            uint32_t reg_act_table_16               :  8; /* [23:16],        r/w,       0xbc */
            uint32_t reg_act_table_17               :  8; /* [31:24],        r/w,       0xbb */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE17_14;

    /* 0x118 : BLAI_ACT_TABLE1B_18 */
    union {
        struct {
            uint32_t reg_act_table_18               :  8; /* [ 7: 0],        r/w,       0xb9 */
            uint32_t reg_act_table_19               :  8; /* [15: 8],        r/w,       0xb8 */
            uint32_t reg_act_table_1a               :  8; /* [23:16],        r/w,       0xb7 */
            uint32_t reg_act_table_1b               :  8; /* [31:24],        r/w,       0xb6 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE1B_18;

    /* 0x11C : BLAI_ACT_TABLE1F_1C */
    union {
        struct {
            uint32_t reg_act_table_1c               :  8; /* [ 7: 0],        r/w,       0xb5 */
            uint32_t reg_act_table_1d               :  8; /* [15: 8],        r/w,       0xb4 */
            uint32_t reg_act_table_1e               :  8; /* [23:16],        r/w,       0xb3 */
            uint32_t reg_act_table_1f               :  8; /* [31:24],        r/w,       0xb3 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE1F_1C;

    /* 0x120 : BLAI_ACT_TABLE_23_20 */
    union {
        struct {
            uint32_t reg_act_table_20               :  8; /* [ 7: 0],        r/w,       0xb2 */
            uint32_t reg_act_table_21               :  8; /* [15: 8],        r/w,       0xb2 */
            uint32_t reg_act_table_22               :  8; /* [23:16],        r/w,       0xb2 */
            uint32_t reg_act_table_23               :  8; /* [31:24],        r/w,       0xb1 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_23_20;

    /* 0x124 : BLAI_ACT_TABLE_27_24 */
    union {
        struct {
            uint32_t reg_act_table_24               :  8; /* [ 7: 0],        r/w,       0xb1 */
            uint32_t reg_act_table_25               :  8; /* [15: 8],        r/w,       0xb1 */
            uint32_t reg_act_table_26               :  8; /* [23:16],        r/w,       0xb1 */
            uint32_t reg_act_table_27               :  8; /* [31:24],        r/w,       0xb1 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_27_24;

    /* 0x128 : BLAI_ACT_TABLE_2B_28 */
    union {
        struct {
            uint32_t reg_act_table_28               :  8; /* [ 7: 0],        r/w,       0xb1 */
            uint32_t reg_act_table_29               :  8; /* [15: 8],        r/w,       0xb1 */
            uint32_t reg_act_table_2a               :  8; /* [23:16],        r/w,       0xb1 */
            uint32_t reg_act_table_2b               :  8; /* [31:24],        r/w,       0xb2 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_2B_28;

    /* 0x12C : BLAI_ACT_TABLE_2F_2C */
    union {
        struct {
            uint32_t reg_act_table_2c               :  8; /* [ 7: 0],        r/w,       0xb2 */
            uint32_t reg_act_table_2d               :  8; /* [15: 8],        r/w,       0xb2 */
            uint32_t reg_act_table_2e               :  8; /* [23:16],        r/w,       0xb3 */
            uint32_t reg_act_table_2f               :  8; /* [31:24],        r/w,       0xb3 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_2F_2C;

    /* 0x130 : BLAI_ACT_TABLE_33_30 */
    union {
        struct {
            uint32_t reg_act_table_30               :  8; /* [ 7: 0],        r/w,       0xb4 */
            uint32_t reg_act_table_31               :  8; /* [15: 8],        r/w,       0xb4 */
            uint32_t reg_act_table_32               :  8; /* [23:16],        r/w,       0xb5 */
            uint32_t reg_act_table_33               :  8; /* [31:24],        r/w,       0xb5 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_33_30;

    /* 0x134 : BLAI_ACT_TABLE_37_34 */
    union {
        struct {
            uint32_t reg_act_table_34               :  8; /* [ 7: 0],        r/w,       0xb6 */
            uint32_t reg_act_table_35               :  8; /* [15: 8],        r/w,       0xb7 */
            uint32_t reg_act_table_36               :  8; /* [23:16],        r/w,       0xb7 */
            uint32_t reg_act_table_37               :  8; /* [31:24],        r/w,       0xb8 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_37_34;

