bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
    /* 0x138 : BLAI_ACT_TABLE_3B_38 */
    union {
        struct {
            uint32_t reg_act_table_38               :  8; /* [ 7: 0],        r/w,       0xb9 */
            uint32_t reg_act_table_39               :  8; /* [15: 8],        r/w,       0xba */
            uint32_t reg_act_table_3a               :  8; /* [23:16],        r/w,       0xba */
            uint32_t reg_act_table_3b               :  8; /* [31:24],        r/w,       0xbb */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_3B_38;

    /* 0x13C : BLAI_ACT_TABLE_3F_3C */
    union {
        struct {
            uint32_t reg_act_table_3c               :  8; /* [ 7: 0],        r/w,       0xbc */
            uint32_t reg_act_table_3d               :  8; /* [15: 8],        r/w,       0xbd */
            uint32_t reg_act_table_3e               :  8; /* [23:16],        r/w,       0xbe */
            uint32_t reg_act_table_3f               :  8; /* [31:24],        r/w,       0xbe */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_3F_3C;

    /* 0x140 : BLAI_ACT_TABLE_43_40 */
    union {
        struct {
            uint32_t reg_act_table_40               :  8; /* [ 7: 0],        r/w,       0xbf */
            uint32_t reg_act_table_41               :  8; /* [15: 8],        r/w,       0xc0 */
            uint32_t reg_act_table_42               :  8; /* [23:16],        r/w,       0xc1 */
            uint32_t reg_act_table_43               :  8; /* [31:24],        r/w,       0xc2 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_43_40;

    /* 0x144 : BLAI_ACT_TABLE_47_44 */
    union {
        struct {
            uint32_t reg_act_table_44               :  8; /* [ 7: 0],        r/w,       0xc3 */
            uint32_t reg_act_table_45               :  8; /* [15: 8],        r/w,       0xc4 */
            uint32_t reg_act_table_46               :  8; /* [23:16],        r/w,       0xc5 */
            uint32_t reg_act_table_47               :  8; /* [31:24],        r/w,       0xc6 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_47_44;

    /* 0x148 : BLAI_ACT_TABLE_4B_48 */
    union {
        struct {
            uint32_t reg_act_table_48               :  8; /* [ 7: 0],        r/w,       0xc6 */
            uint32_t reg_act_table_49               :  8; /* [15: 8],        r/w,       0xc7 */
            uint32_t reg_act_table_4a               :  8; /* [23:16],        r/w,       0xc8 */
            uint32_t reg_act_table_4b               :  8; /* [31:24],        r/w,       0xc9 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_4B_48;

    /* 0x14C : BLAI_ACT_TABLE_4F_4C */
    union {
        struct {
            uint32_t reg_act_table_4c               :  8; /* [ 7: 0],        r/w,       0xca */
            uint32_t reg_act_table_4d               :  8; /* [15: 8],        r/w,       0xcb */
            uint32_t reg_act_table_4e               :  8; /* [23:16],        r/w,       0xcc */
            uint32_t reg_act_table_4f               :  8; /* [31:24],        r/w,       0xcd */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_4F_4C;

    /* 0x150 : BLAI_ACT_TABLE_53_50 */
    union {
        struct {
            uint32_t reg_act_table_50               :  8; /* [ 7: 0],        r/w,       0xce */
            uint32_t reg_act_table_51               :  8; /* [15: 8],        r/w,       0xce */
            uint32_t reg_act_table_52               :  8; /* [23:16],        r/w,       0xcf */
            uint32_t reg_act_table_53               :  8; /* [31:24],        r/w,       0xd0 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_53_50;

    /* 0x154 : BLAI_ACT_TABLE_57_54 */
    union {
        struct {
            uint32_t reg_act_table_54               :  8; /* [ 7: 0],        r/w,       0xd1 */
            uint32_t reg_act_table_55               :  8; /* [15: 8],        r/w,       0xd2 */
            uint32_t reg_act_table_56               :  8; /* [23:16],        r/w,       0xd3 */
            uint32_t reg_act_table_57               :  8; /* [31:24],        r/w,       0xd4 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_57_54;

    /* 0x158 : BLAI_ACT_TABLE_5B_58 */
    union {
        struct {
            uint32_t reg_act_table_58               :  8; /* [ 7: 0],        r/w,       0xd4 */
            uint32_t reg_act_table_59               :  8; /* [15: 8],        r/w,       0xd5 */
            uint32_t reg_act_table_5a               :  8; /* [23:16],        r/w,       0xd6 */
            uint32_t reg_act_table_5b               :  8; /* [31:24],        r/w,       0xd7 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_5B_58;

    /* 0x15C : BLAI_ACT_TABLE_5F_5C */
    union {
        struct {
            uint32_t reg_act_table_5c               :  8; /* [ 7: 0],        r/w,       0xd8 */
            uint32_t reg_act_table_5d               :  8; /* [15: 8],        r/w,       0xd8 */
            uint32_t reg_act_table_5e               :  8; /* [23:16],        r/w,       0xd9 */
            uint32_t reg_act_table_5f               :  8; /* [31:24],        r/w,       0xda */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_5F_5C;

    /* 0x160 : BLAI_ACT_TABLE_63_60 */
    union {
        struct {
            uint32_t reg_act_table_60               :  8; /* [ 7: 0],        r/w,       0xdb */
            uint32_t reg_act_table_61               :  8; /* [15: 8],        r/w,       0xdb */
            uint32_t reg_act_table_62               :  8; /* [23:16],        r/w,       0xdc */
            uint32_t reg_act_table_63               :  8; /* [31:24],        r/w,       0xdd */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_63_60;

    /* 0x164 : BLAI_ACT_TABLE_67_64 */
    union {
        struct {
            uint32_t reg_act_table_64               :  8; /* [ 7: 0],        r/w,       0xde */
            uint32_t reg_act_table_65               :  8; /* [15: 8],        r/w,       0xde */
            uint32_t reg_act_table_66               :  8; /* [23:16],        r/w,       0xdf */
            uint32_t reg_act_table_67               :  8; /* [31:24],        r/w,       0xe0 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_67_64;

    /* 0x168 : BLAI_ACT_TABLE_6B_68 */
    union {
        struct {
            uint32_t reg_act_table_68               :  8; /* [ 7: 0],        r/w,       0xe0 */
            uint32_t reg_act_table_69               :  8; /* [15: 8],        r/w,       0xe1 */
            uint32_t reg_act_table_6a               :  8; /* [23:16],        r/w,       0xe2 */
            uint32_t reg_act_table_6b               :  8; /* [31:24],        r/w,       0xe2 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_6B_68;

