bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
    /* 0x16C : BLAI_ACT_TABLE_6F_6C */
    union {
        struct {
            uint32_t reg_act_table_6c               :  8; /* [ 7: 0],        r/w,       0xe3 */
            uint32_t reg_act_table_6d               :  8; /* [15: 8],        r/w,       0xe4 */
            uint32_t reg_act_table_6e               :  8; /* [23:16],        r/w,       0xe4 */
            uint32_t reg_act_table_6f               :  8; /* [31:24],        r/w,       0xe5 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_6F_6C;

    /* 0x170 : BLAI_ACT_TABLE_73_70 */
    union {
        struct {
            uint32_t reg_act_table_70               :  8; /* [ 7: 0],        r/w,       0xe5 */
            uint32_t reg_act_table_71               :  8; /* [15: 8],        r/w,       0xe6 */
            uint32_t reg_act_table_72               :  8; /* [23:16],        r/w,       0xe6 */
            uint32_t reg_act_table_73               :  8; /* [31:24],        r/w,       0xe7 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_73_70;

    /* 0x174 : BLAI_ACT_TABLE_77_74 */
    union {
        struct {
            uint32_t reg_act_table_74               :  8; /* [ 7: 0],        r/w,       0xe8 */
            uint32_t reg_act_table_75               :  8; /* [15: 8],        r/w,       0xe8 */
            uint32_t reg_act_table_76               :  8; /* [23:16],        r/w,       0xe9 */
            uint32_t reg_act_table_77               :  8; /* [31:24],        r/w,       0xe9 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_77_74;

    /* 0x178 : BLAI_ACT_TABLE_7B_78 */
    union {
        struct {
            uint32_t reg_act_table_78               :  8; /* [ 7: 0],        r/w,       0xea */
            uint32_t reg_act_table_79               :  8; /* [15: 8],        r/w,       0xea */
            uint32_t reg_act_table_7a               :  8; /* [23:16],        r/w,       0xeb */
            uint32_t reg_act_table_7b               :  8; /* [31:24],        r/w,       0xeb */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_7B_78;

    /* 0x17C : BLAI_ACT_TABLE_7F_7C */
    union {
        struct {
            uint32_t reg_act_table_7c               :  8; /* [ 7: 0],        r/w,       0xec */
            uint32_t reg_act_table_7d               :  8; /* [15: 8],        r/w,       0xec */
            uint32_t reg_act_table_7e               :  8; /* [23:16],        r/w,       0xed */
            uint32_t reg_act_table_7f               :  8; /* [31:24],        r/w,       0xed */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_7F_7C;

    /* 0x180 : BLAI_ACT_TABLE_83_80 */
    union {
        struct {
            uint32_t reg_act_table_80               :  8; /* [ 7: 0],        r/w,       0xed */
            uint32_t reg_act_table_81               :  8; /* [15: 8],        r/w,       0xee */
            uint32_t reg_act_table_82               :  8; /* [23:16],        r/w,       0xee */
            uint32_t reg_act_table_83               :  8; /* [31:24],        r/w,       0xef */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_83_80;

    /* 0x184 : BLAI_ACT_TABLE_87_84 */
    union {
        struct {
            uint32_t reg_act_table_84               :  8; /* [ 7: 0],        r/w,       0xef */
            uint32_t reg_act_table_85               :  8; /* [15: 8],        r/w,       0xef */
            uint32_t reg_act_table_86               :  8; /* [23:16],        r/w,       0xf0 */
            uint32_t reg_act_table_87               :  8; /* [31:24],        r/w,       0xf0 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_87_84;

    /* 0x188 : BLAI_ACT_TABLE_8B_88 */
    union {
        struct {
            uint32_t reg_act_table_88               :  8; /* [ 7: 0],        r/w,       0xf1 */
            uint32_t reg_act_table_89               :  8; /* [15: 8],        r/w,       0xf1 */
            uint32_t reg_act_table_8a               :  8; /* [23:16],        r/w,       0xf1 */
            uint32_t reg_act_table_8b               :  8; /* [31:24],        r/w,       0xf2 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_8B_88;

    /* 0x18C : BLAI_ACT_TABLE_8F_8C */
    union {
        struct {
            uint32_t reg_act_table_8c               :  8; /* [ 7: 0],        r/w,       0xf2 */
            uint32_t reg_act_table_8d               :  8; /* [15: 8],        r/w,       0xf2 */
            uint32_t reg_act_table_8e               :  8; /* [23:16],        r/w,       0xf3 */
            uint32_t reg_act_table_8f               :  8; /* [31:24],        r/w,       0xf3 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_8F_8C;

    /* 0x190 : BLAI_ACT_TABLE_93_90 */
    union {
        struct {
            uint32_t reg_act_table_90               :  8; /* [ 7: 0],        r/w,       0xf3 */
            uint32_t reg_act_table_91               :  8; /* [15: 8],        r/w,       0xf4 */
            uint32_t reg_act_table_92               :  8; /* [23:16],        r/w,       0xf4 */
            uint32_t reg_act_table_93               :  8; /* [31:24],        r/w,       0xf4 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_93_90;

    /* 0x194 : BLAI_ACT_TABLE_97_94 */
    union {
        struct {
            uint32_t reg_act_table_94               :  8; /* [ 7: 0],        r/w,       0xf4 */
            uint32_t reg_act_table_95               :  8; /* [15: 8],        r/w,       0xf5 */
            uint32_t reg_act_table_96               :  8; /* [23:16],        r/w,       0xf5 */
            uint32_t reg_act_table_97               :  8; /* [31:24],        r/w,       0xf5 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_97_94;

    /* 0x198 : BLAI_ACT_TABLE_9B_98 */
    union {
        struct {
            uint32_t reg_act_table_98               :  8; /* [ 7: 0],        r/w,       0xf6 */
            uint32_t reg_act_table_99               :  8; /* [15: 8],        r/w,       0xf6 */
            uint32_t reg_act_table_9a               :  8; /* [23:16],        r/w,       0xf6 */
            uint32_t reg_act_table_9b               :  8; /* [31:24],        r/w,       0xf6 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_9B_98;

    /* 0x19C : BLAI_ACT_TABLE_9F_9C */
    union {
        struct {
            uint32_t reg_act_table_9c               :  8; /* [ 7: 0],        r/w,       0xf7 */
            uint32_t reg_act_table_9d               :  8; /* [15: 8],        r/w,       0xf7 */
            uint32_t reg_act_table_9e               :  8; /* [23:16],        r/w,       0xf7 */
            uint32_t reg_act_table_9f               :  8; /* [31:24],        r/w,       0xf7 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_9F_9C;

