bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
    /* 0x1A0 : BLAI_ACT_TABLE_a3_a0 */
    union {
        struct {
            uint32_t reg_act_table_a0               :  8; /* [ 7: 0],        r/w,       0xf7 */
            uint32_t reg_act_table_a1               :  8; /* [15: 8],        r/w,       0xf8 */
            uint32_t reg_act_table_a2               :  8; /* [23:16],        r/w,       0xf8 */
            uint32_t reg_act_table_a3               :  8; /* [31:24],        r/w,       0xf8 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_a3_a0;

    /* 0x1A4 : BLAI_ACT_TABLE_a7_a4 */
    union {
        struct {
            uint32_t reg_act_table_a4               :  8; /* [ 7: 0],        r/w,       0xf8 */
            uint32_t reg_act_table_a5               :  8; /* [15: 8],        r/w,       0xf8 */
            uint32_t reg_act_table_a6               :  8; /* [23:16],        r/w,       0xf9 */
            uint32_t reg_act_table_a7               :  8; /* [31:24],        r/w,       0xf9 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_a7_a4;

    /* 0x1A8 : BLAI_ACT_TABLE_aB_a8 */
    union {
        struct {
            uint32_t reg_act_table_a8               :  8; /* [ 7: 0],        r/w,       0xf9 */
            uint32_t reg_act_table_a9               :  8; /* [15: 8],        r/w,       0xf9 */
            uint32_t reg_act_table_aa               :  8; /* [23:16],        r/w,       0xf9 */
            uint32_t reg_act_table_ab               :  8; /* [31:24],        r/w,       0xf9 */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_aB_a8;

    /* 0x1AC : BLAI_ACT_TABLE_aF_aC */
    union {
        struct {
            uint32_t reg_act_table_ac               :  8; /* [ 7: 0],        r/w,       0xfa */
            uint32_t reg_act_table_ad               :  8; /* [15: 8],        r/w,       0xfa */
            uint32_t reg_act_table_ae               :  8; /* [23:16],        r/w,       0xfa */
            uint32_t reg_act_table_af               :  8; /* [31:24],        r/w,       0xfa */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_aF_aC;

    /* 0x1B0 : BLAI_ACT_TABLE_b3_b0 */
    union {
        struct {
            uint32_t reg_act_table_b0               :  8; /* [ 7: 0],        r/w,       0xfa */
            uint32_t reg_act_table_b1               :  8; /* [15: 8],        r/w,       0xfa */
            uint32_t reg_act_table_b2               :  8; /* [23:16],        r/w,       0xfb */
            uint32_t reg_act_table_b3               :  8; /* [31:24],        r/w,       0xfb */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_b3_b0;

    /* 0x1B4 : BLAI_ACT_TABLE_b7_b4 */
    union {
        struct {
            uint32_t reg_act_table_b4               :  8; /* [ 7: 0],        r/w,       0xfb */
            uint32_t reg_act_table_b5               :  8; /* [15: 8],        r/w,       0xfb */
            uint32_t reg_act_table_b6               :  8; /* [23:16],        r/w,       0xfb */
            uint32_t reg_act_table_b7               :  8; /* [31:24],        r/w,       0xfb */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_b7_b4;

    /* 0x1B8 : BLAI_ACT_TABLE_bB_b8 */
    union {
        struct {
            uint32_t reg_act_table_b8               :  8; /* [ 7: 0],        r/w,       0xfb */
            uint32_t reg_act_table_b9               :  8; /* [15: 8],        r/w,       0xfb */
            uint32_t reg_act_table_ba               :  8; /* [23:16],        r/w,       0xfc */
            uint32_t reg_act_table_bb               :  8; /* [31:24],        r/w,       0xfc */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_bB_b8;

    /* 0x1BC : BLAI_ACT_TABLE_bF_bC */
    union {
        struct {
            uint32_t reg_act_table_bc               :  8; /* [ 7: 0],        r/w,       0xfc */
            uint32_t reg_act_table_bd               :  8; /* [15: 8],        r/w,       0xfc */
            uint32_t reg_act_table_be               :  8; /* [23:16],        r/w,       0xfc */
            uint32_t reg_act_table_bf               :  8; /* [31:24],        r/w,       0xfc */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_bF_bC;

    /* 0x1C0 : BLAI_ACT_TABLE_c3_c0 */
    union {
        struct {
            uint32_t reg_act_table_c0               :  8; /* [ 7: 0],        r/w,       0xfc */
            uint32_t reg_act_table_c1               :  8; /* [15: 8],        r/w,       0xfc */
            uint32_t reg_act_table_c2               :  8; /* [23:16],        r/w,       0xfc */
            uint32_t reg_act_table_c3               :  8; /* [31:24],        r/w,       0xfc */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_c3_c0;

    /* 0x1C4 : BLAI_ACT_TABLE_c7_c4 */
    union {
        struct {
            uint32_t reg_act_table_c4               :  8; /* [ 7: 0],        r/w,       0xfd */
            uint32_t reg_act_table_c5               :  8; /* [15: 8],        r/w,       0xfd */
            uint32_t reg_act_table_c6               :  8; /* [23:16],        r/w,       0xfd */
            uint32_t reg_act_table_c7               :  8; /* [31:24],        r/w,       0xfd */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_c7_c4;

    /* 0x1C8 : BLAI_ACT_TABLE_cB_c8 */
    union {
        struct {
            uint32_t reg_act_table_c8               :  8; /* [ 7: 0],        r/w,       0xfd */
            uint32_t reg_act_table_c9               :  8; /* [15: 8],        r/w,       0xfd */
            uint32_t reg_act_table_ca               :  8; /* [23:16],        r/w,       0xfd */
            uint32_t reg_act_table_cb               :  8; /* [31:24],        r/w,       0xfd */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_cB_c8;

    /* 0x1CC : BLAI_ACT_TABLE_cF_cC */
    union {
        struct {
            uint32_t reg_act_table_cc               :  8; /* [ 7: 0],        r/w,       0xfd */
            uint32_t reg_act_table_cd               :  8; /* [15: 8],        r/w,       0xfd */
            uint32_t reg_act_table_ce               :  8; /* [23:16],        r/w,       0xfd */
            uint32_t reg_act_table_cf               :  8; /* [31:24],        r/w,       0xfd */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_cF_cC;

    /* 0x1D0 : BLAI_ACT_TABLE_d3_d0 */
    union {
        struct {
            uint32_t reg_act_table_d0               :  8; /* [ 7: 0],        r/w,       0xfe */
            uint32_t reg_act_table_d1               :  8; /* [15: 8],        r/w,       0xfe */
            uint32_t reg_act_table_d2               :  8; /* [23:16],        r/w,       0xfe */
            uint32_t reg_act_table_d3               :  8; /* [31:24],        r/w,       0xfe */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_d3_d0;

