bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/npu_reg.h
    /* 0x1D4 : BLAI_ACT_TABLE_d7_d4 */
    union {
        struct {
            uint32_t reg_act_table_d4               :  8; /* [ 7: 0],        r/w,       0xfe */
            uint32_t reg_act_table_d5               :  8; /* [15: 8],        r/w,       0xfe */
            uint32_t reg_act_table_d6               :  8; /* [23:16],        r/w,       0xfe */
            uint32_t reg_act_table_d7               :  8; /* [31:24],        r/w,       0xfe */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_d7_d4;

    /* 0x1D8 : BLAI_ACT_TABLE_dB_d8 */
    union {
        struct {
            uint32_t reg_act_table_d8               :  8; /* [ 7: 0],        r/w,       0xfe */
            uint32_t reg_act_table_d9               :  8; /* [15: 8],        r/w,       0xfe */
            uint32_t reg_act_table_da               :  8; /* [23:16],        r/w,       0xfe */
            uint32_t reg_act_table_db               :  8; /* [31:24],        r/w,       0xfe */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_dB_d8;

    /* 0x1DC : BLAI_ACT_TABLE_dF_dC */
    union {
        struct {
            uint32_t reg_act_table_dc               :  8; /* [ 7: 0],        r/w,       0xfe */
            uint32_t reg_act_table_dd               :  8; /* [15: 8],        r/w,       0xfe */
            uint32_t reg_act_table_de               :  8; /* [23:16],        r/w,       0xfe */
            uint32_t reg_act_table_df               :  8; /* [31:24],        r/w,       0xfe */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_dF_dC;

    /* 0x1E0 : BLAI_ACT_TABLE_e3_e0 */
    union {
        struct {
            uint32_t reg_act_table_e0               :  8; /* [ 7: 0],        r/w,       0xfe */
            uint32_t reg_act_table_e1               :  8; /* [15: 8],        r/w,       0xfe */
            uint32_t reg_act_table_e2               :  8; /* [23:16],        r/w,       0xfe */
            uint32_t reg_act_table_e3               :  8; /* [31:24],        r/w,       0xfe */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_e3_e0;

    /* 0x1E4 : BLAI_ACT_TABLE_e7_e4 */
    union {
        struct {
            uint32_t reg_act_table_e4               :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reg_act_table_e5               :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reg_act_table_e6               :  8; /* [23:16],        r/w,       0xff */
            uint32_t reg_act_table_e7               :  8; /* [31:24],        r/w,       0xff */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_e7_e4;

    /* 0x1E8 : BLAI_ACT_TABLE_eB_e8 */
    union {
        struct {
            uint32_t reg_act_table_e8               :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reg_act_table_e9               :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reg_act_table_ea               :  8; /* [23:16],        r/w,       0xff */
            uint32_t reg_act_table_eb               :  8; /* [31:24],        r/w,       0xff */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_eB_e8;

    /* 0x1EC : BLAI_ACT_TABLE_eF_eC */
    union {
        struct {
            uint32_t reg_act_table_ec               :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reg_act_table_ed               :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reg_act_table_ee               :  8; /* [23:16],        r/w,       0xff */
            uint32_t reg_act_table_ef               :  8; /* [31:24],        r/w,       0xff */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_eF_eC;

    /* 0x1F0 : BLAI_ACT_TABLE_f3_f0 */
    union {
        struct {
            uint32_t reg_act_table_f0               :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reg_act_table_f1               :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reg_act_table_f2               :  8; /* [23:16],        r/w,       0xff */
            uint32_t reg_act_table_f3               :  8; /* [31:24],        r/w,       0xff */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_f3_f0;

    /* 0x1F4 : BLAI_ACT_TABLE_f7_f4 */
    union {
        struct {
            uint32_t reg_act_table_f4               :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reg_act_table_f5               :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reg_act_table_f6               :  8; /* [23:16],        r/w,       0xff */
            uint32_t reg_act_table_f7               :  8; /* [31:24],        r/w,       0xff */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_f7_f4;

    /* 0x1F8 : BLAI_ACT_TABLE_fB_f8 */
    union {
        struct {
            uint32_t reg_act_table_f8               :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reg_act_table_f9               :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reg_act_table_fa               :  8; /* [23:16],        r/w,       0xff */
            uint32_t reg_act_table_fb               :  8; /* [31:24],        r/w,       0xff */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_fB_f8;

    /* 0x1FC : BLAI_ACT_TABLE_fF_fC */
    union {
        struct {
            uint32_t reg_act_table_fc               :  8; /* [ 7: 0],        r/w,       0xff */
            uint32_t reg_act_table_fd               :  8; /* [15: 8],        r/w,       0xff */
            uint32_t reg_act_table_fe               :  8; /* [23:16],        r/w,       0xff */
            uint32_t reg_act_table_ff               :  8; /* [31:24],        r/w,       0xff */
        }BF;
        uint32_t WORD;
    } BLAI_ACT_TABLE_fF_fC;

};

typedef volatile struct npu_reg npu_reg_t;


#endif  /* __NPU_REG_H__ */
